{"text": "The only reason to watch this movie is to see one of the greatest Japanese actors ever born (Mifune) in one of the dumbest \"spaghetti-jidai-geki\" ever made. The poor man must have got the script only after signing the contract. The story is truly imbecile, the direction and camera - very mediocre, and the movie looks like it's somebody's first try in cinema montage. How could anything like this ever get on the screen?", "include": 1}
{"text": "I remember it being one of the best shows of the season when it was released. Now i'm re-watching it via Netflix. The other reviews here don't make sense to me. I do want to see the Britsh version, but I'm glad i didn't see it first. The gist of reviews is that this is a pale comparison, which doesn't mean much.<br /><br />I remember before it premiered, the buzz was mostly questioning whether the US was ready for such an \"unpleasant\" central character. I found Fitz pleasantly realistic and not nearly so obnoxious as the press indicated. The show has a great deal more depth than much of what's on, plus a large dose of simple everyday realism compared with most current dramas (where's Bochco when he's needed?)<br /><br />Currently there seem to be two schools of drama; both rather irritating: In one, focus on characters is maximized but events are somehow super-heightened as to be unreal. Kind of soaps on steroids that grind you down after a while: i.e. Grey's Anatomy<br /><br />The other is the gimmick show, started by ER, which focuses so heavily on it's supposedly clever concept, usually some scientific subject usually just off the radar of common folk, the characters are virtually forgotten; mere robots carrying on the activity necessary to illustrate the subject: Any of the CSI's, Criminal Minds, Numbers, Lie To Me, and a few dozen others they've spawned.<br /><br />Cracker was not clichéd. It was character driven without forgetting to have interesting goings on, and didn't try to twist the viewer into knots with every plot turn.<br /><br />Fitz reminds me quite a bit of Dr. House, especially now that show has lost it's sense of humor as well as the cast and formula that made it great. Cracker was never as brilliant as House began, but then there's plenty of room for both sorts. Perhaps the character of Fitz WAS before the time was right.", "include": 1}
{"text": "I have seen this movie in about 1988 or 1989. Typical 1980's bullshit. Apparently one tried to get some success out of a plot very similar to \"The Delta Force\", another patriotic piece of propaganda. Don't get me wrong, I don't like Arab terrorists at all, but the typical black and white portraiture of demonic Arabs and oh so heroic Americans is too silly. Well, the typical audience in the Reagan area probably liked it. Unfortunately those 1980's \"The-American-Heroes-go-in-and-smash-those-Arab-bastards\"-flicks got some timeliness in recent years and might even find some new audience that wows on it.", "include": 1}
{"text": "Critics and fans alike can rejoice with this, the newest feature from Germany's master of low-budget scares, Andreas Schnaas.<br /><br />ANTHROPOPHAGOUS 2000 is nasty, gruesome, and just completely sickening, but certainly fun to watch. Filmed with completely professional actors and in some gorgeous locations, its really true that Andreas has taken leaps and bounds in filmmaking. This worthy remake of THE GRIM REAPER could use only one thing - a U.S. release! Maybe then, fans could see the beauty of some true German madness!!!", "include": 1}
{"text": "This review also contains a spoiler of the first movie -- so if you haven't seen either movie and want to but don't want the spoilers, please don't read this review!<br /><br />While this movie is supposed to be about Christian and Kathryn meeting for the first time, the movie is a poor copy of the first Cruel Intentions. The actors that they had portray Ryan Phillippe's Christian and Sarah Michelle Gellar's Kathryn are very poor substitutes indeed. Neither can pull off the smarmy, snooty rich-kid attitude that the original actors did. It's absolutely appalling that some of the dialog was verbatim -- not so much between Christian and Kathryn, but if you listen closely enough you'll recognize it. There are also inconsistencies in the plot - if this were truly the first meeting of Christian and Kathryn, then why is it that Christian fell in love with a girl at the end of the movie? He supposedly was supposed to be in love for the first time in the original movie (with Reese Witherspoon's character).<br /><br />Also, the tie-in with the photography/\"You could be a model\" comment at the end was totally lame and didn't add anything at all. Overall, this movie was a waste of time. I can't believe they made a Cruel Intentions 3.", "include": 1}
{"text": "Even though it looked from the box like this movie was low-budget, with a cast of unknowns, I thought it might have some possibilities as a mystery story. I discuss the plot below but do not give away key details.<br /><br />In this 1999/2000 movie, a down-on-her-luck-with-men career woman played by Andrea Roth works at an ill-defined sales firm or ad agency for an apparently kinky boss (Rae Dawn Chong). Chong invites her out to party at the raunchy nightclub \"Pork.\" Roth has just broken up with a \"needy\" nerd boyfriend who keeps calling and following her. At Pork, Roth is attracted to but repulsed by a crass, slick-hair, leather-jacketed, cigarette-hanging-out-of-the-mouth \"bad boy\" (Linden Ashby).<br /><br />Soon, Roth returns to the club alone and picks him up. In one of a number of confusing, poorly presented physical scenes over the course of the film, she lets him press against her and hang her over her apartment balcony railing. It is not clear whether this is meant to pass for wild sex or (as Roth seems to gossip to Chong) just elaborate, get-acquainted foreplay for a later session.<br /><br />Meanwhile back at the office, Chong promotes Roth over two macho jerk co-workers (one of whom Roth is rumored to have dated). Roth comes over to their table at a restaurant, where they are crudely bad-mouthing her under their breath, to try to give them a pep talk. She meets a shy, orange-haired, big-glasses accountant from the firm, who the other two put up to asking her out. He later joins her for a polite dinner at her place.<br /><br />As the increasingly sluggish movie drones on, Roth gets more involved with the bar punk but then tries to pull back when he grows so rough and possessive that it becomes abusive. The nerdy accountant, a shadowy brother, and the old boyfriend hover in the background. One of the macho jerks from the office ends up stabbed to death. The second soon meets the same fate. A scruffy, dogged young cop starts investigating, with the help of a tomboy waitress who wants more of his time.<br /><br />Roth's old boyfriend is arrested when a knife turns up in his car, but he claims he had nothing to do with the killings. Chong drops by Roth's apartment to console her depressed friend, feebly comes on to her, is rebuffed, and is later accosted by the jealous, angry bar punk. Another victim turns up, this time strangled in an alley. In a long, labored, violent scene, the psycho killer is confronted in Roth's apartment.<br /><br />The best that can be said about \"Dangerous Attraction\" is that slender, strawberry-blonde Roth looks pretty on screen, the cop and waitress are likable and make a cute couple, and there are a lot of suspects to confuse the issue for a while. Beyond that, the movie ends up being a frustrating failure.<br /><br />Early on, the film uses some touches that seem to hint at depth and creativity (such as Roth's cryptic narration over a hazy bike-riding scene and Chong's odd behavior). It throws in some melodramatic frills toward the end.<br /><br />But none of this can hide the fact that there is nothing special to the story, dialogue, cast, production values, or sets. The writing is far too thin to sustain the film, which becomes tedious, drawn-out, and overlong. By the time the movie grinds to a halt, with a final \"shock effect\" scene at a hospital (as much of a tacked-on gimmick as an earlier scene of a figure's silhouette in a wheelchair), you could not care less. The characters and acting are dull and flat, even in supposedly dramatic scenes (especially Ashby's annoying performance). No interesting color or detail is developed about the characters or the settings (their professions are mere window dressing). The detective work is almost non-existent. The film amounts to nothing more than an uninvolving, monotonous, surface-level effort that strings you along for what turn out to be cheap, shallow, trite, predictable, unsatisfying payoffs. The best description of the movie that I can think of is a thin crust of formula with no filling.<br /><br />There are also amateurish mistakes, going to substance and style, that make the movie feel like even more of a waste of time. A character gratuitously gives Roth the address of that person's apartment, which leads to a key plot point, when there is no way in the world the person would have wanted Roth to drop by. Chong is poorly used in the film. She is relegated to a lifeless performance in a bit part, and is unflatteringly dressed and photographed, making an attractive woman look old and overweight. For some reason, the movie comes up with nothing but drab sweat-suits for Roth to wear in most scenes (including when she hosts the accountant for dinner). And the love scenes are ruined by sloppy, obvious cutaways to a body double for Roth who does not even have the same shape. This is insulting and unprofessional. The movie has no business using nudity if all it does is to make scenes look fake.", "include": 1}
{"text": "I saw this for the first time recently, and simply had to comment even though the film is a few years old.<br /><br />This is the worst film that I have seen in years! Firstly, it hangs on the tails of the 'Broken Britain' tedious myth that is perpetrated and propagated by the likes of the Daily Mail. Certainly, all of the issues depicted by the film exist and are fully worthy of attention. But could they all exist at once? And do they all happen all the time? Is this what life is about in London today for the average teenager???? No! And that is only one of the reasons why this film is ridiculous.<br /><br />As for the characters, the lot of them could have been put up against a wall and shot and I would have applauded. For instance, I was glad Trife was killed \u0096 and I don't think that was the director's intention unless he's far more subtle than I give him credit for. In fact, they missed a trick here. The characters are so horrible that had they killed them off one-by-one a la Final Destination - instead of messing about with a laughable Romeo and Juliet plot (Pffffttt! Like anyone would care whether those toerags got back together or not!) - it would have been far more enjoyable. I would have particularly enjoyed seeing Katie's dad die in a freak laptop computer incident. I could go on, but I don't think it's healthy....<br /><br />Like I said at the start, I'm a bit confused about the 'Broken Britain' basket this thing sits in, and I really wonder what the intention of the director/screen writer was. Incredibly, an Asian director and a black scriptwriter seem to have come up with a propaganda film for the BNP that gets around the present hate laws. Here is my thinking: <br /><br />i. The black and mixed race pupils beat Katie: a tall, beautiful, middle class white girl, forcing her to admit to being a 'virgin' (by implication a heinous crime according to their 'black ass' thinking) leading her to commit suicide. Trife \u0096 a black boy - then 'stands up' for Katie by declaring that he had sex with her \u0096 thereby clearing her of her 'crime'. Hopefully he wasn't asked to speak at the funeral\u0085.<br /><br />ii. Then, after being given a day-off school for mourning and quiet reflection as a result of Katie's death, the black and mixed-race guys instead decide to go off on a spree of casual sex, violent confrontation, knife-wielding thuggery, drug taking and general mayhem on London's streets and shops \u0096 all set to various rap 'choons'. It is understood by all that the day will culminate in a 'well wicked party' where more of the same will transpire. Trife also finds a bit of time to visit his mentor: an uncle who (surprise) is a black, drug-dealing, murderous, violent, gun-running 'gangsta' who likes to carve his initials on people's faces with a Stanley knife.<br /><br />(Wot d'ya fink so far, Mr Griffin?) Let's carry on for a bit: <br /><br />iii. Encouraged by the example of the males, the late Katie's female classmates also opt for a contemplation-free day. Firstly, mixed-race Alisa kicks things off by announcing that she's pregnant in a mobile phone conversation. There is some confusion over who the father is, and this inspires the noble Trife \u0096 the recipient of the call and the father - to tell her to eff off. In order to help the tearful Alisa cope with this double blow of pregnancy and rejection, her friend Becky suggests a day of shopping, prostitution, casual sex and drugs. Alisa \u0096 after a bit of brow-furrowing - thinks this idea has potential. Off they go.<br /><br />iv. White girls: the characters of Becky and Claire are carefully drawn to conform to Daily Mail reader stereotypes of the 'type of white girls who hang around with blacks' i.e. total sluts. Becky will sleep with anyone for nothing (at the end she wonders around the 'well wicked' party asking people to service her) but prefers to do it for drugs and/or money. Claire, who's a bit more middle-class than Becky, will give you a quickie after twenty seconds of chimp chat-up - if she can fit you in whilst her boyfriend pops to the newsagent for a packet of cigs\u0085\u0085and Claire's mum will provide the condoms with a cheerful smile. Sam, ever the gentleman, threatens to publicly reveal Claire's personal hygiene problems. So what conclusion can we draw? I know! Smelly white female pigs doing it with blacks, ugh! Do I get a star, miss? <br /><br />v. Black misogyny: generally, black males in this film score poorly in aspects of courtly love. There are numerous examples but Sam's treatment of both Katie and Claire is pertinent, as is Uncle Curtis' slap of his girlfriend when she interrupts his cretinous musings and Trife's initial reaction to Alisa's pregnancy. Becky's boyfriend (a deliberately greasy/swarthy/foreign type) gloats over the fact that she's only fifteen and that he has such power over her. Trife charms a twenty-six year old white female architect (she being unaccountably attracted to him) but prefers to steal her purse. Etc, etc, etc. Sigh.<br /><br />The plot lacks all maturity, depth and development. One would be entirely forgiven for thinking that the scriptwriter was himself fifteen \u0096 if not younger. In short: this film would be pleasing to: <br /><br />\u0095 Some fifteen year old boys, who might feel disenfranchised by the way that the girls in their classroom are so very far ahead of them in maturity <br /><br />\u0095 BNP members, for whom it would make an ideal stocking filler<br /><br />Broken Britain, m'botty. One star for the teenage actors, and no stars for anything else.", "include": 1}
{"text": "And I've seen a lot of them. There is more stock footage in this thing than any movie I know except \"Jungle Hell\" (1956). The only difference is that \"Jungle Hell\" was all elephants. This one's all sea lions. On and on and on about the stupid sea lions while the stupid crew in their stupid boat looks for stupid Juan Francisco.<br /><br />Much of the stock footage that isn't sea lions is native women of the South Pacific. I don't know if the editors were blind or what, but whoever was in charge of splicing the stock footage together didn't seem to mind that the women were mongoloid one minute, negroid the next, and caucasoid the next. They change races with surprising speed.<br /><br />There is another prominent stock footage scene. An octopus in an aquarium (you can see him stick to the glass, and you can see the reflection of lights on the glass) battles a moray eel. The eel is defending all his little fish buddies from the mean old octopus. I'm not making this up. This is presented as if it were happening in the ocean for crying out loud. Who wins? Watch and find out!<br /><br />Lots of stock footage of men fishing provides for some humor as the overdubbed voices say things like, \"Watch out for my face.\" But it gets tiring after several minutes of the same stupid footage of the same stupid men catching the same stupid fish.<br /><br />Alas, there is one more big stock footage scene. This one's of the devil monster. It's not a devil, and it's not really a monster. What is it? Let's just say it's not the kind of monster you were hoping for. Juan, who they did find at the end of all those sea lions, battles the \"monster\". Again, you'll have to watch to find out what happens.<br /><br />What really surprises me is that the IMDB says this was edited down from a longer, older movie. That tells me that (1) someone thought the original was worth redoing, (2) someone thought this version was better, and (3) the original must've been worse. I can't imagine.", "include": 1}
{"text": "This film could be a real gem if it would not be a fake; it is largely sustained by the great performance of the 2 actors, also there is a pleasant and fortunate choice of characters around them, the screen play has wonderful passages but ... the whole is incredibly wasted under a ton of moralistic non sense mainly anti sexual: the lovers go around spending their passion in thousands of kisses but never are able to complete it with what you are expecting they must do; instead here is the punishment; after the last stupid, unbelievable and meaningless misunderstanding the girl run away and is knocked down by a car; he visits her at the hospital all seems OK but when he comes again the doctor says she is dead; what do you expect him to do, perhaps bursting into tears? Not at all, he's chilly, calm and serene as it was exactly what he was hoping from the romance. Pure Christian style: the woman who thinks to sex dies.", "include": 1}
{"text": "If you notice, Keith Richards is drinking during rehearsals and who can blame him?? Chuck Berry must have been a nightmare to deal with, but the concert and film are excellent! Chuck does sound a bit out of tune, but makes up for it with his showmanship. The guest stars are well placed EXCEPT for Julian Lennon. And if I am not mistaken he duets to Jonny B. Goode -- an all time classic. Okay, the guy is the son of a rock legend and had a hit or two, but did he really have a reason to be on stage with Chuck and the band?? Also, why did Chuck cut short the interview with his wife??? Still, a great film that offers insight into a pioneer.", "include": 1}
{"text": "Here we have yet another Hollywood butchering of science fiction. Unfortunately Hollywood executives seem to think that Science Fiction fans are either idiots who cannot see the cavernous plot holes (ala Independence Day) or like the butchery of a good book into a movie that seems to use only the barest plot parts and character names.<br /><br />Times and places are changed. It becomes something that only America can solve. Love stories get thrown in for no sane reason. Parts that would make the movie seem more plausible and give an insite into the reason for the invasion in the first place are chopped to a couple of minutes. The easiest way of identifying who does and doesn't have a slug on their back is completely ignored for some unexplained reason. The authorities (e.g. the President) are in almost from the start in the book, but not in the movie. More than one state is involved in the book, compared to three town in the movie. In fact the part of the book that involves other countries is completely ignored. And in the book, there is no \"happy ending\" where the hero goes wandering off hand in hand with his obligatory love interest.<br /><br />Judge for yourselves, but I bet the rumblings from RAH's grave were heard for months after this travesty was foisted on the public.", "include": 1}
{"text": "An unoriginal wanna-be art house flop. I saw it at Sundance and I'm sorry I wasted my vouchers on it. I don't know why, but the people at Sundance last year were really pushing it on the people. The makers ever kept emailing us asking for our comments and suggestions. I told them just what I'm writing here. Don't waste your time or money. The characters were unoriginal. The story was full of cliches and uninteresting plot development. I walked out with only like 15 minutes to go because it just got worse and worse. If I can say one nice thing about it, there was....well...Sorry, I can't say anything that nice about it. If you want to see something like this that is more interesting, might I recommend \"Party Girl\" or \"Monster\". They're a lot more fun, and you'll enjoy them a hell of a lot more.", "include": 1}
{"text": "Viewers with an interest in British history might wish to note that since the first Hanoverian came to the British throne (George I in 1714) it has been occupied by dimwits. These dimwits have fallen into two classes \u0096 those like Victoria, George V, George VI and the present incumbent, who saw themselves as the slaves of duty and therefore as ceremonial heads of state did little or no harm, and those like George IV, Edward VII and Edward VIII who kicked over the traces, but did less damage than one might have expected. The 1936 abdication crisis was a crisis only for those who believe in monarchy, in this country a minority of about 25%, according to the 1999 Republic referendum. The story has been told several times before on TV \u0096 is there anything new about this 2005 ITV version, apart from the Baltic locations?.<br /><br />Well, the publicity says there's more of Wallis's side of the story here, but I can't say that's obvious, apart from there being a bit more of Wallis' Aunt Bessie (Miriam Margolyes). Edward is portrayed as the seducer (in a candlelight chalet in winter) but Wallis (nicely played by Joely Richardson) doesn't exactly play hard to get. She had rivals for the post of prince's mistress (Lady Furness and Mrs Ward) whom she easily defeats. At the end she was left with the baby, or at least the immature prince, a duchess without honour exiled to France. Stephen Campbell Moore is about 10 years too young for Edward but his puppy-like demeanour is appropriate. The triviality of the Windsors is shown by the fact that it wasn't the loss of the Crown that irked them so much as the establishment's refusal to give Wallis the title \"Her Royal Highness\". Diana, of course, had exactly the same beef, but then she was demoted on her divorce. Camilla (for the moment) is a mere duchess, but is also \"HRH\". Winston Churchill, robustly played here by David Calder, was a principal supporter of Edward just because he was a prince, but then Winston was a rather romantic old Tory.<br /><br />Nazi sympathies were not uncommon in the British upper classes prior to World War 2 (\"those Nazi chappies certainly know how to make the trains run on time\") but if an invasion of Britain by Germany had been successful (and it was a close\u0096run thing), Edward, given his sympathies would have been the front-runner for puppet King. Edward was an undistinguished governor of the Bahamas between 1940 and 1945 but the main reason for that appointment was to keep him out of the reach of the Nazis. (Down under we got his younger brother, Prince Henry, who was even dumber than Edward, as GG (1942-1945), but a bit better behaved). After that he and Wallis spent the remaining 27 years of their marriage in very comfortable and well-deserved obscurity in Paris. One is left with the feeling we got lucky.<br /><br />This production has a nice sheen to it and the 30s' era is well evoked. There are some other good performances, particularly 80 year old veteran Richard Johnston as Wallis' nemesis, prime minister Baldwin, and Julian Wadham as Edward's not exactly loyal private secretary Fitzhardinge.", "include": 1}
{"text": "This movie heralded in the Irish Film Industires era of gritty post modern neo-realism. To some it may seem made on a cellphone and scripted by a 13 year old and none too bright one at that. Others will see a slice of contemporary life. The cheap alcohol consumed on an empty stomach and the continual sucking on cigarettes suggests the nausea of life in a post-modern society, the continual need to suck to fill the vacuous nature of existence. People will complain about the shaky hand held camera not realizing that this is a metaphor for Irish life: shaky at the best of times and wouldn't you know it the devil of a hangover and how did I get into this mess. Gritty post modern Irish neo-realism or me kid sister making a film on her cell phone because she's got the grant money and it has to be finished by Tuesday and in the mail. Does it matter? That's a thought to be going on with now. and that's me kid sister, genius or what have you? You decide.", "include": 1}
{"text": "The third movie of the once promising Candyman myth. <br /><br />Candyman comes back to haunt his last descent a girl named Caroline. She tries her best not to believe in his curse so he starts killing people to prove it to her. Then she starts telling everybody he's back but no one believes her of course. And she's also the prime suspect ya-da ya-da ya-da. What else is new?<br /><br />So on to the juicy stuff. <br /><br />Death count on screen: four\u0085 definitely not enough. Off screen old Candy slashes some punks but by some unknown (STUPID) reason we don't see it. Good call there... NOT<br /><br />Gore: plenty but still not enough.<br /><br />Nudity: quick breasts flash from two unknown girls. Could be better.<br /><br />Sex: you wish you sick bastard.<br /><br />Cheese Factor: Medium. There's this old lady that looks just like Yoda and keeps repeating the same phrases\u0085 that was too funny. And Donna D'Errico's acting is pretty amusing too. <br /><br />So what is there to see? Not much. Yes Donna D'Errico runs around bouncing her fun bags but don't expect to see the goods. How could they? A curse on you all! Turi Meyer whoever you are how could you direct this and not give us a good long shot of Donna's only talent? <br /><br />Tony Todd is still cool and he's not overused as in the previous sequel but with such awful material it's hard to shine.<br /><br />This is actually quite boring and galaxies away from the quality of the original,<br /><br />If you have nothing to do and everybody's out having fun and you're home alone on a Friday night and eating cold pizza and thinking how the hell did your best friend got your girl\u0085 well then this might be for you\u0085 if you want to feel REALLY BAD.<br /><br />If not\u0085 save your time.", "include": 1}
{"text": "I love science fiction and Roger Zelzany was one of my favorite authors. Damnation Alley was first a short story and then expanded to a Novella (probably to make the movie from). Hell Tanner (yes, his first name is Hell) was not Jan Michael Vincent, George Parpard would have been better cast as Hell Tanner. In the book Hell Tanner was about as anti as you could get an antihero to be. I was a great story about driving from California to the East Coast to take vaccine for a plague. Hell Tanner was a motorcycle gang member and used to smuggle candy to the Mormons in Utah. I was so excited when I saw that this movie was being made because I had enjoyed the short story so much and then to see how Hollywood butchered it. I'm surprise that Roger Zelzany even allowed his name to be used in connection with this movie. Don't waste your time with this one.", "include": 1}
{"text": "while the show certainly has a dated feel (it does have an annoying laugh track), the jokes were often clever and Joan Davis was brilliant. no, she was not stealing her schtick from Lucille ball (who i also love). Joan was a ditsy, goofy character long before she made it to television. i believe her physical comedy was actually better and more natural (see the movie HOLD THAT GHOST for a brilliant example.) did they steal plot lines from Lucy? well, having not seen this show in a while (i don't believe this show was ever on nick at nite. it was on cbn, of all places.) but i will say that Lucy's plots were not exactly original either, and being that both shows were on at the same time, it's difficult to say who came first (if it even matters). the thing is everyone has seen Lucy for years and just assumes she did it all first.<br /><br />Joan Davis deserves her place in entertainment history along side Lucy, gale storm, Imogene coca and Gracie Allen.", "include": 1}
{"text": "My therapist won't like me talking about it but I've got a bottle of calm-down pills nearby in case this review brings up too many memories for me ad causes...a relapse.<br /><br />This film is dreadful. There aren't enough words to describe how buttock clenchingly bad this film is. It made me want to yell at those responsible about how they were causing physical pain to people with this movie. I was 12 when I first watched this and I thought it was awful then as well. I defy any child to be content with this dross, and if any adult enjoys it I'm sorry but the men in white coats are coming with the special jacket.<br /><br />The plot is nonsense, the dialogue stomach churning and the acting worse than anything seen in a Friday the 13th movie. Avoid if you like your eyeballs and don't want to spoon them out.<br /><br />Now if you'll excuse me I'll just take my tablets and go to bed before they come and take me away again...", "include": 1}
{"text": "F*CK is a documentary that delves into the controversy surrounding the infamous four-letter word. The heart of the film explores the issues of censorship and our constitutional right of free speech. How did the word originate? What exactly does it mean? How has it affected society and how does it continue to affect society? These are just a few of the questions that are addressed in the film. The film features interviews with many different linguists, actors, musicians, artists, politicians, comedians, news commentators, scholars and random people on the streets with intervals of hilarious animation and various television and film clips. The result is a highly entertaining, engaging and fairly well-balanced documentary concerning one of the most controversial words in the English language.<br /><br />Regardless of whether or not one cares about the issues of free speech and censorship, this film is bound to make all but the humorless laugh their f**king hearts out!<br /><br />P.S. Billy Connolly is a riot.", "include": 1}
{"text": "I read some reviews before I rented this little movie and I heard that the quality wasn't that great but i decided to try it out. BIG BIG MISTAKE. Well actually I love watching horrible movies because then at least i can laugh and wonder why anyone would ever make this. First of all it looks like someone took my video camera and decided to do a student film. You can see the camera shaking and you can hear the camera man moving the camera to get different shots. Haha, that amused me. The acting is horrible. haha and man the story itself was just bad. Being sold to white slavery...trying to be funny? Sorry you failed and made me go LAME. Haha this movie...this movie... if you want to see a good movie go see Latter Days or something! Don't SEE THIS MOVIE UNLESS YOU ARE READY TO HIDE YOUR FACE IN YOUR PILLOW BECAUSE YOU FEEL SO BAD FOR THE ACTORS.", "include": 1}
{"text": "This German horror film has to be one of the weirdest I have seen.<br /><br />I was not aware of any connection between child abuse and vampirism, but this is supposed based upon a true character.<br /><br />Our hero is deaf and mute as a result of repeated beatings at the hands of his father. he also has a doll fetish, but I cannot figure out where that came from. His co-workers find out and tease him terribly.<br /><br />During the day a mild-manner accountant, and at night he breaks into cemeteries and funeral homes and drinks the blood of dead girls. They are all attractive, of course, else we wouldn't care about the fact that he usually tears their clothing down to the waist. He graduates eventually to actually killing, and that is what gets him caught.<br /><br />Like I said, a very strange movie that is dark and very slow as Werner Pochath never talks and just spends his time drinking blood.", "include": 1}
{"text": "This is a most exciting, gripping and fabulous film. Bette Midler's electrifying performance was worthy of best actress. The Janis Joplin type performance is stunning - her heart and soul is in her voice which pulsates and vibrates into your very being and sends shock waves of electricity tingling coolly down the back of your spine touching your very soul. This is a gut-wrenching experience that teaches nothing but makes you experience everything.<br /><br />I love this film, the music and the voice and performance of Bette Midler. What a thrill it is to see an artist like Bette Midler perform to such an extreme and lofty level. What a dazzling radiant star that burned so brightly for so short a time and then was so suddenly and prematurely snuffed out. But when an artist gives so much of herself in every song she sings, it is no wonder that her life was slowly drained and eventually terminated by the fans who loved her.<br /><br />I was working with The Canadian Film Institute in 1980, one year after the release of this film, and we put on a festival in Ottawa at the National Film Archives Theatre in July. We started out with \"The Rose\" at 8pm and then concluded with Crawley Films Academy Award winning Documentary film \"Janis\" at 11pm. It was just like a live Rock Concert. The crowd was in a frenzy. The only thing missing was Jimi Hendrix! Love this one. Real entertainment and excitement!<br /><br />I should note that the director, Mark Rydell, does an overview commentary on the DVD version of this film and it is like taking a university level cinematic studies course. He makes interesting and relevant comments on every scene in the film and it is well worth listening to. Highly informative and fascinating!", "include": 1}
{"text": "If you like game shows, I don't know if you'd like this one, it's hardly the same as any normal one. There are ten contestants brought into a dark studio to answer many questions. The rules are when a question is asked if they answer correctly they rise a stage with money, if they answer incorrectly they start again. However if they say bank before a question the money is safe. The reason this show is not like a normal game show is that the contestants work as a team, but they can get rid of a member (The Weakest Link). But the main reason for the game show being different is the host. Normally the host is nice, but Anne Robinson purposely acts nasty and the contestant leaves with nothing but the words \"You are the Weakest Link, Goodbye!\" Anne Robinson was number 25 on The 100 Worst Britons (for being mean), and she was number 46 on TV's 50 Greatest Stars. Very good!", "include": 1}
{"text": "The Henry Hathaway-directed 1941 Shepherd Of the Hills is worth seeing if for nothing else its color, which is as glorious and gorgeous as one will find in a film. Each outdoor shot is like a landscape painting. Along with Gone With the Wind and The Four Feathers, this is the finest use of color I have seen in a movie, and it should be used as a textbook on how to shoot a film in color. Otherwise, the picture is just a pleasing and old-fashioned revenge tale, adapted from a now forgotten novel, and set in the Ozark Mountains at about the turn of the twentieth century. It is nicely written in the idiom of the mountain folk, and features John Wayne in an early, rare non-western role, which he handles proficiently. Betty Field is his spunky love interest in what would now be an Amy Madigan part. Miss Field is lovely in a non-conventional way; she shines as never before or since. The combination of her quiet, almost mousy beauty in an otherwise talky, assertive role is fascinating to watch. Also on hand are Beulah Bondi, Ward Bond, Marc Lawrence, who gives an amazing performance, and Harry Carey, whose pleasantness and plainness I find tiring, though I suppose he's well-cast. There's a ritualistic feeling to the film, with its clearly defined notions of good and evil, the almost formally informal dialect the characters use, the leisurely, strolling pace by which the story unfolds, all contribute to its pastoral quality. The chief problem is that there's no suspense. One senses early on how the thing is going to end, and the characters behave as one would expect.", "include": 1}
{"text": "This mess just reminded me of one of those 70s pan European co-productions that were so prominent at the time. The characters inhabit a Disneyesque, sanitised version of 1920s Austria where everyone and everything is scrubbed shinily clean and everyone walks aboutwearing beautiful clothes. The story itself would be a good basis for adecent dramatic film but as soon as I heard the dreadful dubbed voice coming out of Heinz Hoenig's mouth I knew this was a stinker! Why does the film show Halsman alive and well in America in the 1950s spoiling any dramatic tension - we already know in the first 2 minutes of the film that he is going to be free, whats the point watching any further? (I personally didn't know who he was before watching the film) Why does Martine McCutcheon have to talk with that ridiculous American accent in a film set in Austria????????? All in all an unwatchable mess. Badly scripted, badly directed and badly acted. AVOID!!!!!!!!!", "include": 1}
{"text": "This flaccid remake of Hitchcock's excellent thriller 'Dial M For Murder' dumps not only that great title but numerous chunks of the clever plot, and replaces them with twists of its own that are either predictable or old hat. Michael Douglas takes over from Ray Milland as a slimy rich chap married to unfaithful Gwyneth Paltrow; he blackmails her lover (Viggo Mortenson) into murdering her, but both his scheme and the movie go chronically wrong. The only good bits here are derived from the original play and Hitch's film, but it doesn't make a lot of difference as they're drowned in a stew of padding, unnecessary additional scenes and needless peripheral characters. Possibly the most visible blunder is that the murder set-up is far from perfect, although that's rivalled by silly plot holes like the one in which Douglas goes to Mortenson's apartment to retrieve his wife's wedding ring, thereby removing evidence of a connection between them, but neglects to do anything about the six-foot-wide painting OF HER FACE. An improvement on the original in no way whatsoever.", "include": 1}
{"text": "Enough!! Get over yourself! You seem to harbor the delusion that television is obligated to YOU to be honest and forthcoming. You expect truth and respect from a medium that continually demonstrates it is incapable of either. A medium that places cameras everywhere, and makes it known to the participants; a medium that terms it's programming \"reality TV\" when NOBODY is real when they know they are being watched, appeals to the stupid among us. You seem to be well-educated, yet not bright enough to simply ignore network crap. You clearly have greater issues to deal with than to waste your time railing against the superficial perceptions of a \"give the public what it wants\" producer of a formula TV series.<br /><br />You fell in love with the series, and now you know better - move on. You were never part of the target audience; you simply thought you were. Learn to pick your battles - you can't win this one, because your opinion is irrelevant to them. As you must know by now, THEY DON'T CARE!!<br /><br />I wish you well in dealing with the circumstance you find yourself in, and know that my prayers are with you. You have a bright mind, and you are better served using it to deal with what is real around you. Network television deserves no attention from you - you're better than that.<br /><br />Focus yourself elsewhere; you're better than you think.", "include": 1}
{"text": "The first thing that occurred to me when I was watching Welcome to Dongmakgol was that I was watching a Hayao Miyazaki film. This was simply because of the score and the setting, a near-magical isolated village, complete with folk lanterns and strange wildlife. That, and most notably, the fantastic score, which was composed by frequent Miyazaki collaborator, Joe Hisashi. But, despite some similar atmospheric elements to Miyazaki's oeuvre, the film is very much a Korean film.<br /><br />Set during the Korean war, two small groups of soldiers, North and South, respectively end up in very isolated Korean village in the mountains, in addition to a UN pilot who crashed there. When the two groups discover each other in the antiquated village (most of whom have never seen a gun before) a tense standoff occurs, which results in misfortune for the village. Driven by guilt (or responsibility), these two enemy groups have to learn to work together to fix their mistake. Meanwhile, the UN forces get antsy for their missing planes (which seem to mysteriously vanish over that mountain) and suspect a North Korean anti-aircraft base to be located on the mountain.<br /><br />While the story isn't without its logical hiccups, it's still a well told fantastic anti-war film, having the isolation in the village force all sides to have to deal with the humanity of the other. The film, based on a play by notable Korean screenwriter/playwright, Jang Jin, features a sense of humor characteristic of Jang's style, melting both the serious with the comic and criss-crossing genre lines as necessary. It's largely successful in this regard and the small plot holes are easily overlooked. Unfortunately, the near cartoonish UN villains (which includes a Korean man as the ignored conscience, along with some Korean goons) don't get the benefit of a nuanced portrayal.<br /><br />The picture looks fantastic, along with a couple surreal seaming fantasy sequences which fortunately disguise the weaknesses of some of the special effects. The art/production direction is quite enjoyable to view and I obviously don't have to repeat the merits of Hisashi's score. The direction itself is good as well. The acting, on the part of the Korean actors is strong, except where the characters are shallowly written. The American actors on the other hand are largely cartoons and hard to believe, even within the context of the movie. The lead American, Captain Smith (Steve Taschler), comes off a little better than his one- off peers, but his acting is uneven; whether it's due to his acting skills or his character's limited portrayal, I'm uncertain.<br /><br />Welcome to Dongmakgol has a lot going for it, especially its mix-up of fun, fantasy, comedy and drama, as well as its admirable message of harmony and unity. I found the fantastic elements a little ungainly, but the fantastic atmosphere was very well embellished, and drawing in Joe Hisashi was a stroke of genius for the film. While the film has some minor logical hiccups and treats its villains with much less nuance than its protagonists, it still remains a largely enjoyable yarn and worth watching for those that appreciate this sort of film. 7/10.", "include": 1}
{"text": "Aided by saloon owner Marlene Dietrich, John Wayne and his cantankerous partner Harry Carey Sr. battle claim jumping of the legal variety, perpetrated by villainous bureaucrat Randolph Scott.<br /><br />A sometimes painfully slow first half, partially due to Dietrich's role being stretched out to fit her top-billed status, is redeemed by an engrossing and exciting second half, including a rousing climax at Wayne and Carey's mine and a helluva great fist-fight between the Duke and Scott.<br /><br />Harry Carey easily gives the best performance of the film. He and his rifle steal every scene they're in!", "include": 1}
{"text": "Just one meaningless, inscrutable scene after another. I was quite confident that it would all come together in the end, which is why I was looking forward to its conclusion. There are several ways to interpret everything that was seen (almost none of which may have actually happened) but I wasn't able to come up with anything harmonious. So my consternation spiked when all I saw was a dark hole, and the credits rolled.<br /><br />The main character has a lot of episodes which are clearly delusions, but then there are many rational-looking scenes some of which are contradicted by other rational-looking scenes.<br /><br />Anyone who likes this movie cannot care one toss about the plot, since in the end, the only thing we can be sure of is that Jeff Daniels thinks therefore he is.", "include": 1}
{"text": "I'm not sure what the people behind this bomb were on, but whatever it was, I want some. A shark movie that begins with alien spaceships fighting should be warning enough that you are about to have 90 minutes of your life sucked out your rectum with a straw.How do you get a budget and a cast to even do something like this? If you're fond of Ed Wood, you'll want to see this and get an idea of what Ed could have done with an actual budget. But then again, Ed Wood movies are so bad they're watchable over and over again. With RAGING SHARKS, once is twice to much. If you're in the mood for seeing rehashed Discovery Channel and National Geographic shark footage, this one's for you.", "include": 1}
{"text": "terrible....boring,and these people acted like morons.....i turned it off after getting tired of listening to these guys repeat every question a million times. they just say the same crap over and over.....and the marriage scene made me sick. annoying little bastards.<br /><br />I'm sure the movie was powerful in its own right,and i really wanted to see the hardships these guys went through, but i just couldn't get over how they talked to each other....the constant nagging gave me a headache,they were reminding me of 4 year olds bugging mom at the toy store.<br /><br />i would have like to have seen what happened after the marriage,but i couldn't get through it.....im sure this movie was great n all,but personally i like my films to not put me to sleep.....just didn't really need to be a flick,as far as im concermed. im sure you al think im shallow,but think what you will,i have a healthy respect for film,and im not the Hollywood lover you might assume i am. film doesn't need to be boring to make a statement.", "include": 1}
{"text": "For my purposes, this title gets a 8 out of 10. Five for the movie itself, an extra two points for Mr. Spiner's diamond blue eyes, and one for the set designer who had the presence of mind to arrange Spiner's character's color scheme around them. Everything around \"Devlin Bowman\" is blue and white and the effect is quite striking.<br /><br />The movie is a ninety minute fart joke. I'm not kidding.<br /><br />Harold Gould, by far and away, delivers the best overall performance in the movie (such as it is). Casting James Brolin in this movie was a definite stroke of completely ridiculous genius. Austin Wolff is, of course, adorable, and Dana Carvey's particular brand of multiple personality disorder is as entertaining as ever (I got a definite chuckle out of Mr. Peru).<br /><br />Like I said, the movie is a ninety minute fart joke and is quite clearly directed at males between the ages of eight and twelve. If you have a roomful of those kind of people and you'd like them to stop breaking things by playing baseball with the ceiling fan, this movie will at least put them all in one room and occupy them with disgusting noises for about an hour and a half. There's no swearing. The (incredibly) mild \"blue\" content is really tame and based on a cartoony visual gag, as is the \"violence\". It's supposed to be a silly, sight gag based comedy and that's exactly what it is.<br /><br />As for Spiner (you knew I was getting to it); first of all, he's gorgeous. Like I said, the character's entire color scheme is a shade of electric blue that compliments his eyes to the point of being captivating. I was hitting the pause button just because I *had* to look. The jokes are (of course) at his character's expense (he *is* the bad guy, after all), and he, appropriately, rolls out his very best \"smarmy/irritated\" act (the one that stole \"Out To Sea\" right out from under two legends). It's amusing and relatively gentle right up until the climax of the movie, where he hits the \"crazy button\" and doesn't look back. Then it's just plain hilarious. In terms of Spiner-related content, I got exactly what I wanted out of this movie and just a little bit more.<br /><br />By the way, Classmates.com owes Spiner a big, wet kiss (trust me).", "include": 1}
{"text": "The film, Cyborg was a relatively unimpressive movie. I explored that the realism within was quite lacklustre, with reference to when Van Damme's character escapes from the crucifiction cross - then began a mighty fighting scene, which was highly disappointing to the viewer.<br /><br />The antagonist was also quite disappointing on appearance and acting skills. His fighting technique was quite pitiful, and although so was Van Damme's, the slugfest was rightly won by the 'Muscles from Brussels'.<br /><br />To recommend this film to a friend, would make them believe that i was the enemy. The film showed glimpses of hope, but nothing progressed from it. A very disappointing film.", "include": 1}
{"text": "Using the life of Mark 'Gator' Ragowski as the thread, director Helen Stickler tracks the rise of skateboarding from underground pastime to cultural phenomenon. As corporate America jumped all over the sport, the proponents got richer and the sport of skateboarding more mainstream, but some of the players weren't equipped for the fame and money - Gator amongst them.<br /><br />With a great soundtrack, excellent original resources and unparralleled access to the sports biggest names (many of whom skated with Gator and are now owners of Skateboard companies), Stoked is as much a look at the Eighties and the gluttony of the times; some made it through unscathed, some profited nicely, and one at least is going to be in jail for some time to come!<br /><br />Stoked is a great documentary, for fans of skateboarding and pop culture junkies alike", "include": 1}
{"text": "Forget Heinz Ruehmann playing Heinz Ruehmann interpreting the \"Hauptmann von Koepenick\", concentrate on some of the remarkable supporting actors and actresses to have at least some fun. And then, try to get 1931's \"Hauptmann von Koepenick\" with Max Adalbert...", "include": 1}
{"text": "How horror should be.<br /><br />I was fortunate enough to view this prior to The Call of Cthulhu at the Leeds Film Festival in 2006 and to be honest, Oculus was better.<br /><br />Goes to show that you don't need masses of blood and gore and elaborate sets to produce chilling horror.<br /><br />I found myself holding my breath on more than one occasion as well as looking for a non-existent cushion to hide behind!<br /><br />That's how good it is!<br /><br />The acting was brilliant and it was really well written - the story will appeal to any fan that loves a spine-chiller.<br /><br />Looking forward to other instalments and hoping to get this on DVD someday.", "include": 1}
{"text": "Hilarious! There is not another word to describe this film. I remember I've seen this when I'm 15 and I could not get a ticket to another film. This weekend I rented it \u0096 just to review what i already thought, 20 years ago, it was a disaster. It was a period of ufanistic productions where one hero could destroy anything that threats America or its ideal of freedom. Films like Rambo II, Red Dawn, Commando or Rocky IV looked seen to be wrote by someone at Reagan's office, but at least they had some qualities. This Braddock had none. Chuck Norris leads the scariest cast of all times (M Emmet Walsh should be punished to do a film like that - how come he had done Blood Simple later?). The screenplay does not make any sense (Braddock kills a character vital to the story \u0096 a big shot Vietnam general \u0096 and there are no consequences), the action scenes are primary (the sequence with the boat \u0096 that should be the climax! - seems to be shot by high school students), the cinematography is awful (mixing up sequences on a bright day and others made on a numb one). So... if you want to remember how the action movies in the 80's were disastrous without its great icons (Stallone and Schwarzenneger), take a look at Braddock... I only wonder if \"Invasion USA\" is even worse...but that you can tell me.", "include": 1}
{"text": "Very disappointing! I saw this documentary at a screening event and I actually walked out of the theater cause it was so bad. The sound editing was terrible, fisher's voice is enough to drive anyone into a mental institution (seriously - like freakin long pointy nails on a chalk board), and the bottom line is i don't think anyone really even knows of or cares about this man. I mean I certainly never heard of him, my friends never heard of him, so why make a film about him? why? My suggestion to the producers....try making a documentary about something worth watching next time and hire a different editor and sound person while you are at it. Also, maybe go back to film school, if you even attended, and try it again", "include": 1}
{"text": "I will sit through anything with demonic rituals, so I sat through this. On checking web reviews, I have become convinced there are two different versions. \"CryFi\" from Lansingburgh says in his review here on IMDb \"surprisingly, there's no nudity.\" There was also no nudity in the DVD (Rhino) that I saw (there is also very little blood and almost no horror). However, over on cndb, reviewers are talking about how glad they are that there is nudity in the movie and judging the different actresses' \"racks\". Mr. Skin gives it three stars (!!!) for \"great nudity\" and lists four actresses as being nude during the flick. Does anyone know what is the situation with this film. It's hard to believe Roberta Findlay would make a movie without nudity, but there was not an inch of skin on the Rhino DVD, though there were scenes where I would have expected skin. Anyone know what's up?", "include": 1}
{"text": "This is what grind house movies are all about. They lack most of the things that one would think, make up a good movie (i.e.- no budget, no name actors, poor art direction, rough cinematography, etc.). But this is exactly the type of movie that you expect nothing from, and it gives you an unbelievable amount of entertainment.<br /><br />If there is any way you can get a hold of a print of this film, or have a chance to see it at a revival house, I suggest you do. It is much better to watch on film than it is on DVD. <br /><br />I believe this film is a sequel (one of many) to the film \"Zombie A.K.A: Dawn of the Dead\" originally directed by George A Romero. The Second Zombie film was done by Italian director Lucio Fulci and was entitled simply, \"Zombie\" here in the U.S.<br /><br />Truth be told, I expected little from this Italian import campy horror flick. But as the film progressed, I realized that it is just the kind of nostalgic grind house film that select demographics will enjoy for years to come.", "include": 1}
{"text": "After all the recent pornographic movies such as Murder and the like, it's really refreshing to have a D E C E N T Indian film which the entire family can watch. Sure the film wasn't brilliant but it beats the other crap Bollywood has been spewing out ever since the arrival of Mr. Imran-Gigolo-Hashmi. What a treat to see Kajol on screen again. She truly is the gem in the crown of Indian cinema. And as for Aamir...well, his done it again. After his stellar performance in Rang De Basanti, he pulls off the role of Rehan with immense warmth and passion. I know this is probably a pipe-dream, but it would be fantastic to see these 2 set the big screen ablaze again. Kudos to Kunal Kohli for reminding the world of what a true Bollywood film is made of!", "include": 1}
{"text": "Enjoyed this horrible horror film mainly because I just wanted to find out what it was all about and since I have been a big fan of Dorothy Malone for many years and enjoyed her performance in the great film, \"Inherit the Wind\". Dorothy Malone was 62 years of age in this film and showed her age, however, she knew what she looked like and was a true actress and was eager to perform on the silver screen. This story involves a young newlywed couple and the bride inherits her aunt's mansion and all its belongings along with some 8 million dollars hidden the house. The girls aunt, Dorothy Malone committed suicide and had many ghosts hanging around the old mansion and there is plenty of horror with living dead and bodies being chopped up like chop meat. This will make a great Holloween Night Film for a spooky party after Mid-Night. Enjoy.", "include": 1}
{"text": "For publicity at a nightclub, Kiki's manager Jerry Manning gets his hands on a tame black leopard for her performance. But it gets scared, and manages to escape into the small New Mexico town. The town becomes incredibly frightened, when one dead body is replaced with another each night and the evidence is pointing towards the leopard. Although Jerry doesn't believe it is the leopard doing the brutal killings, but someone using it to their advantage.<br /><br />\"The Leopard Man\" is another from the Val Lewton staple and it's probably his most unique one too. After directing the minor classics \"The Cat People\" and \"I Walk with a Zombie\", Jacques Tourneur returns with another successful stint in the power of suggestion with slick finesse and creepy atmosphere to boot. Tourneur's masterful direction carries the disjointed and fairly unconvincing screenplay by Adrel Wray. The interlocking structure that shifts back and forth between major and minor characters is an interesting (if ambitious) experiment for its time. While being well paced (since it just clocks over the hour mark), it plays more like separate little stories or set pieces to the bigger picture. This gave it an unpredictable pattern on who's going to get it next. This was achieved by the way chance-like camera-work sweeping across the screen onto different characters. Strangely enough the minor stories are far more interesting than the major one of Kiki and Jerry. The problem was I didn't particularly feel any sympathy for any of the characters (well, only the first victim) and the film's final revelation is rather flimsy and truly unfulfilling. Tourner likes to focus on the individually cold-hearted deaths with great skill and subdued intentions. The intensity he brings to the screen with great use of the camera, lighting, sound effects and the music score only added to the dramatic effect of each scene. This was enhanced by the hauntingly bone-rattling edge and eerily shadowy sets. He sure demonstrates some compelling patches that truly are blood curdling without the need of showering the viewer with too much detail. The first death scene is a perfect example. The performances are mostly fine from a fancy cast, if little underdone by Jean Brooks and Dennis O'Keefe. The problem is that they feel to glitzy than being down-to-earth folks. A zippy Margo definitely shines in her flamenco dancer role. Also floating by are sound turns from Ben Ward, Abner Biberman, Isabel Jewell, James Bell and Keefe Brasselle.<br /><br />What mostly keeps you involved with \"The Leopard Man\", is Tourneur's memorable touches and Margo's colourfully etched performance.", "include": 1}
{"text": "Frogs 1972 (Quickie Review)<br /><br />Frogs is just, quite simply, a very bad movie. One of the absolute worst out there. Walk through Wal-Mart one of these days and take a good long gander in that disheveled \"2 DVD's for $11\" bin. Otherwise known by myself, my family and friends of mine as the \"Wal-Mart $5.00 bin.\" Dig through there and you'll find hyper Jesusy \"Left Behind\" movies, films Pierce Brosnan likely forgot he did, and disk after disk of Jean Claude Van Damme, Steven Seagal, and Chuck Norris crappy action flicks. Craption if you like. You'll also, eventually, see this movie. And at $5.50, it's overpriced by about six bucks.<br /><br />This monstrosity is about a family living in an old Southern plantation house surrounded by swamp. And eventually, they're getting killed by frogs. The cover of the DVD looks promising, true\u0097-complete with giant frog on the cover with somebody's arm sticking out of the mouth. Well, rest assured, nothing even remotely that cool is found anywhere in the film. Poor acting, vanishing story, zero atmosphere, and sh!t music carry this monstrosity along showing you that, yes, someone actually filmed something more boring than 24-straight hours of the New York City skyline (Andy Warhol did that once). The frogs never grow to gigantic proportions, nor do they propagate in such massive numbers that they could overwhelm even the most inept baby. Yet, somehow, they break into the house and the family members start to die. And that's the whole movie. You'll hear glass break, then you'll hear someone scream, then you'll see a body on the floor with anywhere from 3-7 frogs either on the body or on the floor nearby. Even as \"camp\" or \"kitsch\" this movie is unbearably bad.<br /><br />So next time you rifle through that $5.00 bin at Wal-Mart, do you're very best to avoid this\u0085 this thing. Grab \"Leatherface\" or that cheesy-ass Chuck Norris movie instead. Fvcking don't waste money on \"Frogs.\" 1/10 (I don't give zeros.)<br /><br />www.ResidentHazard.com", "include": 1}
{"text": "I can't help feeling that everyone is jumping on the bandwagon saying this is the worst film ever made etc.<br /><br />I viewed this film for the first time on laserdisc on a video projector in a darkened room with some mates and we found it to be entertaining different atmospheric in parts. John Agar for once has some good lines and does well. The script is a fairly complex one far more than other film of its vintage and budget. We thought the writers should be commended for using such plot devices as intolerance to light and the sub-culture within a sub-culture. Even the ending is unexpected and different. It even has an opening prologue which is a lot of fun. While this film does not hit its target on everything it tries to do, we thought the creators had a pretty good go at it.<br /><br />I do not honestly understand why so many people think this film is so bad. Maybe seeing it projected on a big screen in a darkened room made a difference, I don't know, but if you have never seen the film before try it with an open mind you may well enjoy it as much as we did.", "include": 1}
{"text": "Insipring great movie. Don't be fooled because its from lifetime. Great movie. This coming from a straight 24 year old male. This movie is about one woman's life story and the ups and downs of a life without the best of starts. A girl raised with all the wrong cards rises above it all and makes her own hand of cards for the game of life. This is one story that brings tears (not for me), joy, and inspiration. This movie is really sad in the fact that this is a true story. However, it helps me to know that in real life someone was faced this awful situation and still overcame it with hard work and determination. This movie is from everyone except for small children who can't handle some of the themes of family violence and drugs.", "include": 1}
{"text": "Most of the time, 99.9% of the time, I find comedy embarrassing and corny. No doubt this is because comedy is the hardest thing to do. Therefore if it is so hard, a lot of people are going to fail. And a lot of people do. You need to be intelligent to really be funny. Once again not many people are all that smart either. To give you an idea of some things I find funny: I like David Letterman but not Jay Leno. Find South Park and the Simpsons amusing and think 'The Office is one of if not the funniest things on television ever. In my opinion 'Live In Concert' is the greatest stand up comedy performance of all time. Add this to the list of things you MUST see. Pryor has got it all, voice and the way he uses it, facial expressions, acting ability, intelligence. One of the best things I notice about his style is that you are never aware when he has moved on to the next joke. The transitions between jokes are as good as the jokes themselves. This is something that the best speakers have, the ability to move from one topic to the next so that the listener is not aware of the transition. This is achieved by the speakers ability to relate topics.", "include": 1}
{"text": "This may be the best softcore erotic movie ever made, and its a shame that more people didn't see it in America when initially released in 1975 at the height of the Sexual Revolution, before AIDS came along and took all the fun out of swinging. One reason why the film wasn't so popular is that just a few years earlier, the first Emmannuelle film, based on a supposedly true book by Ammanuelle Arson, was released with much hoopla - and seen by many people, most of whom did not particularly like it, myself included. There was a glossy look but a nasty edge to it all - the sex seemed joyless, owing to the awful approach of Just Jaecken. So people stayed away from the sequel, which is all about the joy of sex! And is absolutely sweet and seductive, lush and lovely - everything that the first Emmanuelle movie was supposed to be but wasn't. If this had been released first, everyone would have been delighted. This remains the most perfect film by which you can revisit (on screen) the truly joyous feel of sexual liberation in the mid-seventies, though steer away from its predecessor. Best sequence: Kristel's lovemaking, in an Asian brothel, with Laura Gemser, shortly to start a series of her own as . . . Black Emmanuelle!", "include": 1}
{"text": "<br /><br />Trapped was how I felt while watching the film Entrapment. I couldn't wait for the movie to end. I went through the other reviews and was thoroughly surprised to read that there were many people out there who enjoyed the movie. My thinking is that - what was there to enjoy? The plot was unoriginal, the script lame and the acting absolutely soulless. As far as I was concerned, it could have been two unknowns as the lead actors and the effect would have been the same. It is such a waste that big names like Connery and Zeta-Jones were used for a humdrum movie like this.<br /><br />Much was said about the \"chemistry\" between the two leads. Romantic, intriguing, charming were some of the words I saw being used to describe the relationship. I beg to differ. I would use more befitting words like contrived, incestuous and downright disgusting. Didn't anyone notice the 40-year age gap between them? Had they kept their relationship purely professional, then the movie would have been slightly more palatable.<br /><br />There were two reasons why I decided to watch the movie. First was the two leads and second, the filming location. Having being disappointed by the former, I was hoping that the latter would have been the saving grace. Being a Malaysian, I was eager to watch how the Petronas Twin Towers, currently the tallest building in the world, would have looked on the big screen. Of course, a sense of pride enveloped me when the first few glimpses of the majestic towers were shown. It is not often that major movie productions come here for filming. Although some scenes were manipulated (like the scene when Connery and Zeta-Jones were on a boat on the Malacca river with the Twin Towers on the background. Malacca and Kuala Lumpur are over 100 km apart!), I couldn't help but feel a sense of fulfillment whenever a familiar setting was shown. Notwithstanding the fact that none of the actors who potrayed Malaysians were actually from Malaysia. Perhaps \"Anna and the King\" starring Jodie Foster and Chow Yun-Fatt would do justice to talented local actors. This remains to be seen as the movie is still actively shooting here.<br /><br />In conclusion, I feel that unless you're a Malaysian, there's nothing that the movie can offer that's groundbreaking. You'll leave the cinema with a hollow feeling and will find yourself hard-pressed to recall a scene that will make an impact in your movie-going life.", "include": 1}
{"text": "In Holland the second season is now on TV. I couldn't wait and i watched in on DVD already. <br /><br />I also liked season 1 but it wasn't as good as sex and the city. But the second season is so good!!!! Much more humor which i really liked! The best part of season two for me is the episode where they go to the spa (without alcohol en cellphones....) when they go back as fast as they can... hahaha....and then they get car trouble. They open the hood en they are staring at the engine. It was hilarious! <br /><br />In short. From season two i love this show!!!!! Really funny, but also real problems en great lovestories....just GREAT! I hope there will be much more seasons to come, i can't wait!", "include": 1}
{"text": "Mr Chopra stole the idea from \"Catch me if you can\" and added all that garbage Hindi Masaalaa. Direction was totally senseless. You can make a comedy, which has some sense. But looks like current Bombay Directors start from the base thinking that all public is stupid and they can put any \"masaalaa\" in movie, to stretch it for 3 hours as long as they put some top faces on screen and show some skin. If they wanted to copy from English movie, they could have done better job. They could have taken some lesson from \"Angoor\". But by making some foreigner walking around in India, with millions of dollars in his bag and Deputy Commissioner of Police dancing around in Clubs made it a total senseless movie. In short - A senseless movie, total waste of time and money.", "include": 1}
{"text": "and a throwback to the time of John Wayne Westerns, where people did what they did for the right reasons and not for power and glory.<br /><br />This movie has just a hint of darkness, as in the conversation between Bill Cody and the Chief who asked Cody to rescue the mustangs. But for the most part, it was full of light. A story of personal redemption for a man who felt more than guilty for seeing the wrongs that were happening yet chose to say and do nothing.<br /><br />Only one thing bothered me about the film -- I think at times Hildalgo looks at Hopkins with eyes that were perhaps computer-effected.<br /><br />I know that the story was an exaggeration, but it did not matter. It reminded me of the Tall Tales of Paul Bunyan, or Davy Crockett, or Daniel Boone. Did we ever question their \"truthfulness.\"<br /><br />I am tired of the cynical sophisticates who takes all joy out of life in the name of art and reallity. Is reallity television more real than Hidalgo. The reallity is that we need stories and myths to give power and meaning to our lives. When Hopkins accepted that truth, he was empowered and strengthened enough to finish the race.<br /><br />In choosing to accept the reallity of Hidalgo, I am accepting although temporarily that myth has power and meaning.<br /><br />", "include": 1}
{"text": "A middling horror yarn that gets decent mileage out of a thin story line and a premise that's too silly for words. The feature lacks any semblance of professional polish but manages to convey the backward, clannish atmosphere of a rural Georgia town where flash storms and downed power lines gradually unleash a terrible, crawling menace. A spurned suitor for a girl's affections is scarier than the worms that attack the town with a vengeance. However, this twisted farm lad has his own plans for revenge. The cast isn't distinguished but Fran Higgins, a droll, rustic type, is spirited and has her moments, such as they are. The movie has the usual unexpected shock scenes when the story line drags and the special effects don't really work well at all. Still, this film has its devotees and is regarded by some as a camp classic.", "include": 1}
{"text": "The worst movie I've ever seen, hands down. It is ten times more a rip-off of Lake Placid than it is a sequel. Director David Flores clearly did not go to film school, and the way his cast delivers they're lines, you'd think they were learning English for the first time. Not even Cloris Leachman tries. The first Nintendo games had more convincing special effects. Needless to say I didn't make it to the end of Lake Placid 2, but you don't need to watch more than five minutes to know that this is the biggest waste of celluloid in modern film. Do not let your love of the original tempt you to try this, even if you know it's bad. It's a turkey, no not even a turkey, it's nothing.", "include": 1}
{"text": "A classic if you have absolutely NOTHING better to do.This includes watching paint dry and grass grow. Having said that I have s soft spot for this. I saw it when I was 7 or 8 in a theater for a birthday party. One of the cast members was even sitting in front of us. The old mill in the movie is used at Halloween as a spook alley so I have been through it once. This is the worst movie I have seen and probably ever will but a few years ago I got thinking about it and manages to get myself a copy of it so I am the proud owner of the worst movie ever made. If you can find it watch it once. Then any movie you see after that won't be too bad.", "include": 1}
{"text": "I loved this movie.<br /><br />**** Spoilers below ************<br /><br />It has the the supernatural going on all around while no one can see it. Is it really happening or are they hallucinating? A priest with a number running around high on LSD and virgin's blood.<br /><br />The play on all the popular satanic subcultures was funny. A priest, trying to do evil like an amateur and then getting beat up at a death metal show. Drug guzzling death metal loser who lives with his mom saving him at every turn, not to save the world, just hanging with his new pal.<br /><br />It made me laugh while keeping me on the edge of my seat the whole time.", "include": 1}
{"text": "I started watching this show when I was sick and there wasn't much to watch during daytime TV. At first I thought it would be bad acting because that is the case with a lot of soaps. But after a couple weeks I really enjoyed it and actually hated leaving during the day because I would miss it. The characters all are different, yet I feel like I can really understand all of their point of views even if they are conflicting. My favorite characters are Kate and Chelsea even though they aren't known as the nicest people at least they they are believable. I also admire Sammi because of her determination, meaning she is not one to give up even if she may hurt someone else. I think Kayla should change her hairstyle, it was better before.", "include": 1}
{"text": "I'd been awaiting this film's release for over a year now, and finally, after a bunch of problems with editing and whatnot, this movie got a DVD release. \"The Woods\" tells the story of a troubled girl named Heather (Agnes Bruckner), who is sent to a secluded private girls school in 1965 by her estranged parents after causing problems and lighting a tree on fire in their back yard. Ms. Traverse (Patricia Clarkson), along with two other women, run the old school. Heather doesn't seem to fit in at the school, and has a rough first week there, getting in scuffles with a snobby bully named Samantha (Rachel Nichols). Her only friend is Marcy, a quiet girl who is nice but shy. As she spends more time around the school, Heather has nightmares and hears strange voices, and is told the story of some witches who took over the school 100 years ago. As more strange events occur in and around the woods surrounding the school, girls begin to disappear.<br /><br />Unlike some, I found \"The Woods\" to be a satisfying horror film. I'll start off with the story - it's intriguing but derivative, I'd describe it as a hybrid of \"Suspiria\" and \"The Watcher in the Woods\", which are both films that I love, I might add. While it does borrow ideas from these films, it's nonetheless an imaginative and entertaining movie. The direction in the film was great - Lucky McKee, who spawned the unique fairy-tale-like horror film, \"May\", does a good job with this film. There are some really creative & spooky sequences and some nice cinematography to offer, plus the great '60s atmosphere was strongly present, brought to life through the costumes, sets, and the vintage score, and providing a perfect backdrop for the story to take place. I tend to have a soft spot for period pieces, so I really liked the time setting.<br /><br />The acting was on par and flowed naturally, the whole cast performed very well. Agnes Bruckner is likable in her role and Patricia Clarkson was great as the mysterious, something-isn't-quite-right-about-her Mrs. Traverse. Horror legend Bruce Campbell (of the \"Evil Dead\" series) plays Heather's father, although his role is pretty minor. And Rachel Nichols, who had a small role in the \"Amityville Horror\" remake, plays the rude school bully very well. There are some neat special effects used nicely throughout the film, and weren't too overdone. The CG was surprisingly really real-looking. I felt the conclusion of the of the film was slightly rushed, but I've seen films end much quicker than this, so for me it wasn't really a big deal. Plus, the ending features some great witch slashings via an axe, which was a nice addition to the film since the majority of it is gore free.<br /><br />Overall, \"The Woods\" is a satisfying horror movie. It's different, but it's imaginative and throughly entertaining, with a great story and a strong vintage atmosphere. Definitely not bad at all, especially for a horror period piece. Other than the slightly rushed conclusion, I can't really say anything bad about it. It took over a year to finally get a release (in any form), but the wait was well worth it. I love stuff like this, so it was almost perfect for me. One of the better horror films of the past year. 9/10.", "include": 1}
{"text": "I have been trying to find this movie for over the last 20yrs. Back in 1985, I saw the trailer for it on T.V. and it started out with an ice cream truck driving down the street. Some kids and adults gathered around the truck while the announcers stated that \"The Stuff\" was here. It's creamy, yummy and you can't get enough of it. Then it showed a man who had eaten about half his ice cream cone and the announcer changed his tone and said, \"It will take you over, eat you and kill you.\" and the camera zooms up on the guys mouth, and you can see the creamy white \"Stuff\" eating away the inside of his mouth. Bleah!! It was pretty gross and freaked me out back then. Something like this would have 4-10yrs old running from their T.V. sets. Talk about setting up kids for nightmares.<br /><br />I tried googling \"parasite eating ice cream\" to no avail, until one day on IMDb, I was looking up info on an old \"Snuff\" film from the 70's and saw \"The Stuff\" come up. Immediately, I knew this was the film. So I ran to the video store and was able to rent it.<br /><br />Not only was this movie, not scary, but the acting and the comedic nature were even worse. To make a long story short, here is the premise. Two guys working at a petroleum factory stumble across a pool of white creamy stuff in the ground. One of the guys sticks his finger in it and tastes it. Now I don't know about you, buy any normal person would never taste anything coming out of the ground unless it was water from a Spring pool. Anyway, the guy who tastes it says it taste real good. So good in fact, that they decide to market it as a new kind of ice cream treat, even though it's \"not\" ice cream. Before you know it, it's the best thing since the hot dog and everyone is eaten the stuff in gallons. People who try it, can't stop eating it. This causes other tasty treats on the market to lose profits. Several snack food manufacturers come together and hire an investigator to find out where and how this \"Stuff\" is made. In comes David 'Mo' Rutherford, the private detective who will investigate this tasty treat's mystery. He soon finds out that \"The Stuff\" is causing people to become uncontrollable zombies. The Stuff takes over their bodies and when it's done using them, it eats their insides and leaves through their mouths. It's alive. He also eventually finds out where this stuff is being stored.<br /><br />The special effects of this \"stuff\" is average at best. The movie \"The Blob\" (Steve McQueen) did a better job and that came out many years before this. The acting is pretty back. Only Michael Moriarty seems to be enjoying himself. Paul Sorvino and Danny Aiello are completely wasted in this film. Garrett Morris makes a short appearance, but he was actually better in \"Car Wash\" then in this campy horror flick. Actually, his scene is the only scary part in the film. You'll see.<br /><br />The whole movie is pretty far fetched and if this \"stuff\" was at retailers everywhere, wouldn't there be other investigators and even FBI agents investigating this problem? I think Larry Cohen was basically trying to send a message to consumers who constantly eat and drink the same bad foods day after day (Starbucks coffee, donuts, burgers, french fries and of course ice cream). He's saying don't eat this crap as it can eventually kill you, just like \"The Stuff\". We get it, but it still doesn't make the movie any better.<br /><br />I also think some of the scenes were removed from the film as well. Besides the ice cream truck scene in the trailer, I thought the poster scene with Jason's family in the kitchen on the floor being eaten by the Stuff was in the movie as well. It didn't show up on the DVD, so either it was cut or it never existed and I'm imagining things. A sequel to this movie could be interested if done right. The story of how the \"stuff\" is discovered would need to be changed of course, but an adequate sequel could be accomplished. Similar to how \"The Blobl\" was remade.<br /><br />This movie is not really worth a look. If you must see it, just rent it. It's not even a horror cult classic like The Cube, Phantasm, The Howling or Donnie Darko. I gave it a 4/10 and that was probably being generous. If you're going to made a comical horror film, watch Evil Dead and Evil Dead 2 and take lots of notes. \"The Stuff\" isn't funny or scary. It's mostly a waste of time.", "include": 1}
{"text": "What is it with intelligent people? Nerds, for lack of a more colorful but expressive term, make for surprisingly interesting stories. There is something about watching people attain another league of mental skill that humbles the rest of us. Sure, there's the madness that sets in (ala \"A Beautiful Mind\"), but what about the quiet cheers brought about from a film like that Spelling Bee championship flick, \"Spellbound\"?<br /><br />\"Wordplay\" fits into that category of documentary film-making, as it further instills certain modesty into the lesser minds of us viewers. The film cleverly interweaves the tale of several competitors who rival one another at the twenty-eighth annual crossword puzzle tournament. As their stories develop, and we learn about these individuals, the actual match builds with surprising tension. These stories are told side-by-side interviews with other crossword enthusiasts such as former President Bill Clinton and TV's Jon Stewart who offer their own passionate opinions on the pleasure and overall importance of crossword puzzles. It's a fun, entertaining film that could easily have been otherwise.", "include": 1}
{"text": "This has to be the comedy of the year. What a comeback for Todd Bridges. Excellent writing and acting. This thing had me laughing my ass off all day. I saw it three times in a row. The funniest character is barney bumble, a old school pimp from Oaktown. Basically Todd Bridges and his buddies are all out of the green stuff. They go all over town trying to score. one thing leads to another and Todd's character \"JIMMY\" is arrested and thrown in the slammer. His buddies spend the rest of the movies going to various characters and go through various obstacles until they finally score. From a whitey hating white pimp, weed dealer. This fool has an umbrella in every scene. He speaks like he's from the ghetto-est ghetto. HILARIOUS!!!!!!Great rent, better buy. Thanks, and please make another one.", "include": 1}
{"text": "Coming to the IMDb site to review this commercially successful movie, I was amazed at the Oscar recognition it garnered in 1978 for what is, to my eyes and ears a very unremarkable re-make of the enjoyable 1941 Claude Rains feature \"Here Comes Mr Jordan\", while surreptitiously grafting on the title of another \"life after death\" 40's classic starring Don Ameche.<br /><br />I just don't have a lot to say about this vapid entertainment other than apart from transforming the hapless Joe from a boxer to an American footballer (and thus losing some of the universality of his character), it seems almost a line for line, scene for scene, inferior copy of the much superior original. Buck Henry and Elaine May were celebrated comedic writers of the time but I found nothing laugh-out-loud funny in what I saw and heard. The cinematography is merely average, soft focusing around Beatty & Christie's love scenes while the acting gig for all must have been the easiest payday they ever earned. Beatty plays every scene either with bemusement or winsomeness, Christie couldn't even be trusted to adopt an American accent and so we're expected to accept her Transatlantic-hopping English rose character who wins Beatty's heart with one flutter of an eyebrow or flick of her over-permed hair. Add to that the great James Mason seeming to sleepwalk his way in Claude Rains' bigger footsteps, Dyan Cannon in permanent histrionic mode and a cast of many along for the ride. The Oscar nominated score is all sappy MOR muzak too.<br /><br />I've read that Beatty made this film with one eye on the box-office returns to fund his ambitious \"Reds\" project, a film I'll be watching soon and hope was worth it. For me this particular movie just demonstrates however the schmoozy, lackadaisical, condescending work which came out of late 70's LA Hollywood studios.", "include": 1}
{"text": "Cynthia Rothrock turned down a part opposite Jackie Chan to play a larger role in this Yuen Biao action thriller. Biao plays a lawyer who takes the law into his own hands when the bad guys shoot a good friend of his outside the courthouse (hence the UK title 'Above The Law'). Rothrock plays an almost identical role to that of the earlier genre classic 'Yes, Madam'. Corey Yuen Kwai takes the action a step further than that in 'Yes, Madam', making Biao and Rothrock look better than ever in a number of impressive action sequences.<br /><br />Biao's acrobatic talents are showcased magnificently as he flips, kicks, abseils and uses all available weapons (vases, axes and dead bodies!) in an attempt to punish the crimes of others.<br /><br />This is the definitive Hong Kong action flick of the 80's, easily on a par with 'Police Story' and should take pride of place in any fan's collection.<br /><br />Also, if possible, get the 'Universe' DVD as this contains both versions of the film and the original language.", "include": 1}
{"text": "I don't own the DVD (yet), but have seen this documentary on cable several times. It was quite interesting, but what drew my attention was the song played at the end called \"Darkness Darkness.\" I have not been able to catch who sings the ballad or who wrote the song. By the time I can focus on the small print and see the song's name, the screen changes. Can anyone tell me who wrote the song, who sings it in this documentary, and if it is available? Thanks! :O)<br /><br />In addition, I would like to know what James Cameron sees in Bill Paxton. His acting in all his movies (if you call it acting) is truly awful. His narration in this documentary was just plain pathetic. His choice of words and his comments just did nothing for the documentary. All I kept saying to myself was \"I wish he would shut up!\" Mr. Cameron should have done the narration himself or at least chose someone else to do it...anyone other than Paxton. Other than that, this documentary was quite interesting to watch. The footage obtained was awesome. <br /><br />If anyone could help me with the music I've noted above, I would appreciate it. Thanks!! :o)", "include": 1}
{"text": "For the third Crow outing, I was left feeling rather skeptical of watching this considering the disaster with City of Angels? <br /><br />I actually purchased this film on DVD in May last year and regrettably passed on to a friend considering I wasn't going to watch this too often as much as the original. <br /><br />This time around it seems to have learnt from the mistakes from the 2nd part by sticking very closely with the themes of the original.<br /><br />Eric Mabius was a surprise indeed for the lead with Kirstin Dunst on hand in a supporting role. Parts of the film did lack in places but was still exceptional viewing nevertheless. <br /><br />I wasn't too sure about the villainy, as I thought the police being behind the murderous cover-up of Alex Corvis's (Eric Mabius) girlfriend (played by Jodie-Lynn O'Keefe) was little cheesy not mention repetitive with the idea of the police being the bad guys.<br /><br />Visually it does resemble the original a lot and thumbs up Eric Mabius as well as he does pay homage to Brandon Lee very well.<br /><br />I thought Fed Ward wasn't as menacing as he appeared to be, but was decent attempt.<br /><br />Not bad, but please tell Miramax/Dimension to stop panning out any further Crow sequels as they really should have learnt their lesson with the last outing.", "include": 1}
{"text": "There is one and one reason alone to see this dull, uneventful horror flick: Billy Drago. Its very perplexing to me why an actor with his immense talent and underrated potential ends up in crapsack projects like this. Nevertheless, he is still captivating as a giggling, psychopathic, sleazy town sheriff and supernatural 'mummy'. But as for any parts of the movie without him: boring, boring, boring. Even the usually excellent Danny Trejo looks awkward and embarrassed playing a character whose dialogue consists of chuckling heartily to himself for ten friggin minutes strait.<br /><br />Avoid unless you're a die hard Billy Drago fan like me.", "include": 1}
{"text": "Since most of the political bellyaching about this movie seems to be coming from the self-righteous right, I'm going to ignore it and just talk about the film itself. What starts out as a well-acted exploration of family tensions - especially those between a relatively uneducated set of middle-class parents and their college-educated son - gives way to the clumsy, overwrought melodramatics of the second half of the film. The death of Robert Walker during filming doesn't really excuse or explain the awfulness of the last hour. There's an early scene between John and his mother in which he explains that his goals are the same as those of the Catholic Church in which they were both raised but that his methods are different. The fact that he is a Communist (McCarey and some of his apologists seem to suggest) means that those goals must be evil because the methods are evil. Just stop thinking for yourself; trust in God and the FBI. It's a dangerous message, and not all that far off from the one that the Communists drilled into their victims (for \"God and the FBI\" substitute \"the Party\"). Oh, well . . . I guess I couldn't avoid the political bellyaching.<br /><br />The sad thing is that the lead actors are all so good. McCarey was brilliant at getting excellent naturalistic performances from his actors, and Helen Hayes, Robert Walker, Van Heflin and Dean Jagger are all extremely convincing until the film collapses into right-wing agitprop at the halfway mark. Even Hayes couldn't do much (except overact) with her climactic scene in which her character tries to use a football analogy to get her son to see the light.", "include": 1}
{"text": "Captain Chaos, The Rat Pack, Terry Bradshaw and Mel Tillis! Burt, Roger Moore, and Mr...um...Foyt! Some say this isn't a masterpiece, there are no digital effects or Oscar nominated performances. Please! It's just fun watching some of the greats who have passed on and some others who were in their prime having a blast doing a movie that makes little sense and that's just the way I like it. I promise you will laugh and you won't know why, but you won't care! Great movie for anyone who wants to have a beer with his friends and watch a funny, pointless, silly movie. Unfortunately, I also recommend Peter Jackson's King Kong for the same reasons.", "include": 1}
{"text": "I get such a kick out of all the comments that mention how beautiful Jennifer Connelly is. Basically because in this movie that's all Josie's ever heard... how she's such a great piece of a$$ (\"the town tease\"), and the redundancy of these comments she's encountered up to now has her almost proud of that fact. \"... I never tease...\" But the truth is, nobody cares who she is as a person (including you the viewer), and that kills her. Those that have criticized and commented on the movie are actually characters IN the movie. As we comment on how beautiful Connelly is, we in turn become a part of Josie's past, and we are responsible for who she is now. Add the issues of her father, who only threatens her (and the cop) with abuse and attempts of control. Josie is physically beautiful, but that is her main problem. She's a really f'ed up chick. She is a temporary trophy, until something better comes along. And being that negative attention is better than no attention at all, you can understand what brought her to the store in the first place. When Jim tells Josie of his dream of her, she instantly thinks \"sex\"... cause up until this point in her life, that all she has to offer anyone. She is instantly caught off guard when Jim suggests a simple dance, one that he's been dreaming of since the 7th grade. And of all the people Josie has ever been with, Jim is the first gentleman she's ever met. And for the first time in both of their lives, a true connection is made. Yes, the Home Alone skits are below average, but for me, the problem is that they take away from the connection that the two leads are making. The best part of this whole movie is the unspoken dialogue between Connelly and Whaley, as they tried desperately to comfort each other in this time of chaos. Whaley has most of the creative dialogue, but Connelly's character is the one of interest (and issues). This is a much more psychological romance than most give it credit for.", "include": 1}
{"text": "This might have been called Lost Girls...or Bratz Dolls: The Movie!<br /><br />If any single phenomenon might symbolize the death of romance & heterosexuality it could be the Suicide Girls. Their name says it all. They seem about as estranged from the organic sense of their bodies as anyone on earth could possibly be. They seem to regard their bodies like drum majorettes regard their bodies or pompom girls their skirts. <br /><br />They are little forlorn islands of desolation & despair. They make Gummo play like Singing in the Rain.<br /><br />The occasional individual insights are pathetically revealing. The one who calls herself Reagan (Reagan? Nixon? Is all this a political statement? - I don't think so...) says that she really appreciates being forced to mingle with the public in the companionship of her \"sisters\" because otherwise she might have become an antisocial person who watches TV or sits in a corner & reads books. <br /><br />Books!! Egads! What a concept.<br /><br />On & on it runs.<br /><br />Great if your want to get turned off to sex or just get generally DEPRESSED!", "include": 1}
{"text": "Stuff like this makes me question if it's possible it could ever be made in America. Sure, we have David Lynch, Guy Maddin, even David Cronenberg, adding to our wonderful world of extremely disturbing for the sake of disturbing film-making, but could they go to this level? Or am I being unfair to say that this is a different level? It could be the same intent with a different approach...<br /><br />We have three segments, each \"extreme\" in their own way. The first, a shockingly gross-out horror film involving foetophagia (pardon me my neologism if there happens to be a real word for said consumption out there), is about all the wonder in blood and gross biological matter you can possibly compress into gut-churning madness. Too bad it doesn't really have much more to it than that, because honestly once you get over the initial \"gut\" reaction, there's not much more to care about... no spectacular cinematography, nothing really amazing in performances... no real reason to be a movie as opposed to a photograph, a written story, a bad tale told over candlelight. I'll just pretend it's all symbolic of the current issue over stem-cell research and leave it at that.<br /><br />The second segment, by the wonderful Park Chan-Wook of Oldboy fame, gets a little better. Our little friend Park has an eye for torture, I see, as now it involves a movie director and his wife tied to his own house-like set, a disturbed extra putting him through physical and emotional turmoil. This one has no long-winded development of psychological torture-by-hypnotism, this is straight out lose-if-you-do, lose-if-you-don't. The focus on the stage lighting and the levels of truth and deceit make it an interestingly post-modern look at spectatorship, as now these characters are forced to look at each other take up and remove their costumes in a twisted dynamic. Too bad that theme isn't really developed much more than just being there, because again, this film has a little bit less in terms of cinema. It has some neat tricks here and there, just nothing to write home about.<br /><br />The third segment, and my favorite, is from my man the amazing Takashi Miike of Ichi the Killer fame. A much more atmospheric and involving film, indeed, this is the story of a woman who dreams fitfully about her accidental murder of her twin sister at the age of ten, with a slightly more complex plot involving a circus performer and pedophilia. Mostly films that turn out to be \"just a dream\" are kind of disappointing, but this has something fresh to add to the group. It also has the most to offer cinematically, with real care put into editing, production design, imagery, juxtaposition, and whatever possible to embellish mood. Of all the segments, this is the most artsy and lovely, and really a good end to round up the features we've been subjected to.<br /><br />Overall, don't expect to eat comfortably after viewing this film. Not gonna work out well. I wouldn't expect the most amazing stuff awaiting you, but on the other hand if you're the type to be absolutely fascinated by the places the human mind will go, see how you handle this. The Marquis de Sade would be proud.<br /><br />--PolarisDiB", "include": 1}
{"text": "Any film which features an unusual plot and a nude scene from Ursula Andress can't be all bad, but in most other departments Soleil Rouge (known in English-speaking countries as \"Red Sun\") is a disappointment. The director Terence Young may have made three successful Bond movies, but the rest of his career was littered with mediocre-or-worse films like The Christmas Tree, The Klansman, Inchon and The Jigsaw Man. This is another example of Young under-achieving as a film-maker.<br /><br /> In 1870, a locomtive makes its way through the Wild West. Aboard is a small band of Japanese travellers, heading for Washington with a valuable sword which they are to present to the President as a gift from the Emperor of Japan. An outlaw, Link (Charles Bronson) and his gang storm the train and steal various valuables, including the afore-mentioned blade. However, one of Link's accomplices, Gauche (Alain Delon) steals the loot for himself, almost killing Link in the process. A samurai warrior, Kuroda (Toshiro Mifune) sets out to retrieve the sword. Link joins him, hoping that he can catch up with his double crossing partner and exact his revenge...<br /><br /> The film is a real mongrel of a movie. Backed by French, Italian and Spanish financers; directed by a Brit; and starring American, Japanese and Swiss leading actors, it is hardly surprising that it seems to draw its inspiration from a muddled patchwork of influences. For a while, the unusual plot threatens to develop into something really interesting. The fusion of western conventions and samurai movie conventions is initially intriguing too. However, pretty quickly the whole thing slips into overly familiar cliches and it is barely helped by somewhat tedious pacing and supporting actors with such heavy accents that it is hard to tell what they are saying much of the time. Red Sun could have been - perhaps should have been - a good movie, but what it emerges as is, unfortunately, rather a waste of a good idea.", "include": 1}
{"text": "This is a tremendous movie I must say! Unfortunately I only got to watch it on a small poor TV, but the style and plot is still captivating.<br /><br />The strongest point is a very nice style: 50-ish random big city, neither clearly American or European. It is always dark, sun never shines, everything looks a bit run down. Some puddles and rain reinforces the mood.<br /><br />The start of the movie is wonderful in its total mystery; it is really a whole lot like a Kafka novel as the main protagonist walks around in a strange world discovering ever more of it. And it is really really strange in an absolutely wonderful way. <br /><br />The basic premise of aliens putting humans in a lab far out in space and messing with their minds is really nice, and the way they do it interesting enough. However, I felt that the movie dropped some in its intensity when the mechanics behind the scenes get revealed. An unseen horror is always more interesting than a seen horror. <br /><br />The end is a bit disappointing as it all digresses into a \"big fight\" in classic american style. <br /><br />But the final end is nice in that there is no complete happiness, only a hint that things could be getting better. <br /><br />Overall, better than most movies. An 9 out of 10!", "include": 1}
{"text": "Sitting down for Macbeth the Comedy I was rather expecting a kind of Iris Murdochesque production, full of in-jokes about Shakespeare and Macbeth in particular. How wrong I was. Macbeth: The Comedy takes Shakespeare's well-crafted tale and adds a liberal sprinkling of modern low-level American humour. Apart from lots and lots and lots (many) jokes about gays and lesbians there was an attempt to lace the movie with slapstick comedy, presumably lightening the scene. This didn't work at all, being more the kind of slaphead comedy that doesn't make it much onto tv any more. I was pleasantly surprised to find no toilet humour, but the tone wasn't held much about that with much sniggering concerning the abovementioned lesbian and gay characters in the film: for which one must assume there is a reason. Somewhere.", "include": 1}
{"text": "Greatly enjoyed the development of the story line, the music and, not least, the acting. Lekin is very good work by done by experienced professionals. Dimple K. completely inhabited the character of Reva, while Vinod Khanna created an image of benevolent intelligence. The use of the first-class rail compartment, a most impressive Rajput<br /><br />Palace and the stark sandy desert provided an appropriate background, supporting the story without overwhelming the mystery. The music was well integrated with the story line, something of a departure (in my limited experience with Bollywood movies). My wife and I have been baffled trying to identify the instrumental- only musical theme which plays whenever Dimple's character Reva appears.", "include": 1}
{"text": "If you aren't old enough to cherish the memory of Sid's Caesar's Show of Shows in its heyday, if you don't think Mel Brooks, Woody Allen, Neil Simon, Larry Gelbart and the rest of his writers' room was the greatest collection of comic talent ever, and if you didn't watch most of the Army-McCarthy hearings, well, maybe this movie isn't for you. But you're just the one who should see if for its educational value. It tells us a whole lot about the golden age of television, of the country's torpor in the 50's, of the days when people who cared more for those dependent upon them than they did for themselves got run over by the corporate machine, and of the contrived and deliberate dumbing down of our national intellect. See this movie, and then rent some of the classic skits by Caesar, Reiner, Coca, Morris and company on DVD. You'll know why those of us who were there still die laughing the hundredth time we hear, \"You have gespritzen on un general.\"", "include": 1}
{"text": "TAXI is the American remake of the quirky 1998 Luc Besson comedy. While the core of the film is still oriented around fast cars, hot chicks and zany humour, the film's light-hearted French comedic ambiance has been replaced with a dirtier, more strident, and somewhat more serious American action-comedy feel, which, although it tries hard, doesn't quite translate as it should. Queen Latifah leads as Belle Williams, a taxi driver who runs a souped-up Ford around the meaner streets of the city. Jimmy Fallon plays the unco New York cop who lands in her cab one day in pursuit of a bunch of foxy Brazilian bank robbers. Together, they muddle through car-crashes, shoot-outs and weirdly-decorated apartments to bring crooks to justice. While the plot sounds like a good premise for a decent comedy, the film is sorely lacking in script composition. The one-liners are crap, the jokes feel forced, and the script, which alternates between taking itself too seriously and sheer stupidity, does no justice whatsoever to the energetic and talented cast. A major disappointment from what looked to be a brilliant film. Someone should remake it in six more years - with a little more skill, I hope.", "include": 1}
{"text": "My Rating: * out of ****. <br /><br />I saw Anger Management for the purpose that there was not much else out. Lets just say, I hated it. I think Adam Sandler has an uneven resume, there are movies I like of his and there are some I just dont care for. I have never actually hated one of his movies (although I never saw Little Nicky, nor do I want to), but Anger Management actually begins a new category. Adam Sandler movies that are plain terrible. <br /><br />Anger Management offers an interesting premise. But with all the bad and unfunny jokes its just a mess of a movie. There may have been possibly one time when I laughed, but thats it. Theres a twist at the end that I would have thought was more clever, if the movie had been somewhat watchable.<br /><br />The acting is not much of a strength. I thought Adam Sandler was great in 2002's Punch Drunk Love, but I found him unconvincing and dull here. Jack Nicholson makes his character into a caricature. This performance does call for Nicholson to be over the top, but hes just ridiculous and kind of annoying. I wanted his scenes to be cut or maybe someone else to play the character. Marisa Tomei is somewhat pleasant to save a few scenes of the movie, but she is not in it much. <br /><br />Anger Management could have been good, and thats probably the biggest disappointment. It needed a more intelligent script, and as much as I'm a fan of Jack Nicholson, I dont think he should have been in this movie. Anger Management is a waste of a movie.", "include": 1}
{"text": "Having not seen the film before, my thoughts were that with Stanwyck, Burr, and Hayden, along with character actor Dano and Fay Wray, how could I go wrong? The actors were wasted on this disjointed script, and the drivel that takes place is almost unwatchable. Some examples: Stanwyck saying I only want to make you happy and hope all your socks have holes so i can darn them then all day. And where was the building up to the marriage. They met, and in 5 minutes were married. The movie builds nothing, things just happen as if the director was on a LSD trip. AVOID.", "include": 1}
{"text": "This 3-part production is the most perfect thing I've ever seen on television - the writing, acting, direction, locations, costumes, etc are faultless. Episode two, where Lady Slane learns that Mr Fitzgeorge fell in love with her when they were young, but never revealed his love, is a triumph, and reduces me to tears every time I watch it. Why this series isn't available on commercial release is a mystery, because they just don't get any better than this.", "include": 1}
{"text": "I saw this film in Washington, DC in 1995 and have since purchased the tape. It is a blast of African pride and anti-slavery vigor from Ethiopian-born director Haile Gerima. Gerima is a professor at Howard University in DC and his films confront the issues of race, integration, and violence in Africa and America. \"Sankofa\" is available through Mypheduh films (Gerima's production company) in DC.<br /><br />The story begins and ends on a small island in West Africa, where 'Mona', an African-American fashion model, is in the present day. The middle of the film consists of Mona, through magic realism, being transported back to a slave plantation in 18th-century America. For those of you who wonder about what it was like to be a slave back then, under those barbaric and intolerable conditions, this is your chance. \"Sankofa\" is not for the faint of heart. Yet its violent scenes are never overdone, and the film's final 'message' is a positive one.<br /><br />It's a shame that this film at this time has an IMDB \"rating\" of only 5 or so, because 31 of the 44 votes cast have been \"10\"s, including mine. I guess this film has alienated a few people, but most powerful films do that. A very important film from a gifted and underrated director.", "include": 1}
{"text": "This Columbo episode is one of the best episodes of this popular long running series. It is based on a California Senate campaign. I loved to watch this one to see Katey Sagal as the candidate's secretary, years before her Married with Children fame. I enjoy watching Joanna Linville's performance as the drunken candidate's wife. Columbo is at his greatest in these classic episodes. The plot is well written and sensible to understanding the motives and actions of the murder. One of the best scenes is when Columbo goes to an exclusive tailor in Beverly Hills and ask about buying a suit. They recommend Sears or some mainstream department store. After all, Columbo can't afford a tailor made suit on a detective's salary.", "include": 1}
{"text": "This film is a heavy one. The acting is intense and the suspense carries through the whole movie. As Kiera Knightly's first leading role, I must say it goes against the glam sexy characters she so often chooses now. Thora Birch is also noteworthy although her British accent is inconsistent at the best of times. On the whole it was too intense for me, but I guess that just shows that it pulls no punches. The scenes with the trapped teenagers succeed in conveying a sense of claustrophobia and panic leading to despair. Some scenes actually made me a bit nauseous. Daring undertaking for the young cast and shows that monsters, cheap shot scares and gratuitous special effects are not necessary to scare you. I don't think I could watch this again.", "include": 1}
{"text": "Black Dawn (2005), The Great one is back in this recent effort(kind of an ironically bad word to use) which follows Johnathan Cold once again as this time he springs a terrorist from prison and appears to be helping in an upcoming attack. It was smart to try to make us guess whether or not he was on the bad side, but come on, we all KNOW he wasn't. I think that if he was, the movie would have been nine times better. The car chase, some decent gunfights and the presence of character actor Timothy Carhart elevate this above a one, but it is still very, very poor. People complain about Foreigner and Out for a Kill, but they both look like Oscar winners compared to this wretched piece of excrement. Steven Seagal is about in HALF of it and even that's a stretch. The fight scenes are NOT him leading me to believe we should give up on seeing the big guy fighting again. His screen presence is a draw, but not when he ain't on the freaking screen. At least he looked like he enjoyed Today You Die and did some fights himself. People, as a Steven SEagal fan, I know you want to see this. But trust me, he may return with a good movie like Belly of the Beast or Into the Sun, but this isn't it. I know you want to see it, but please trust a fellow fan and don't. You'll feel more secure in you're seagal liking if you don't.", "include": 1}
{"text": "The Awful Truth is an old-time humorous-type movie picture what your grandparents like to watch on the old-time movie channel because it takes 'em back some sixty years. Your grandparents aren't loving it 'cause o' some brilliant-type screenplay or some clever-type editing job. They love Cary Grant and Irene Dunne together. I happen to like it for the same reason. Cary Grant and I coulda been buddies. He's a really funny guy, and standing next ta him woulda made me look more handsome than I am. Irene Dunne? If only I could whistle on a freaking keyboard.<br /><br />The narrative-type story starts off with Cary boy coming back home from one o' those business trips, if ya know the kind I mean, but he finds Irene, his wife, his out someplace. When she gets back, she's got some fresh European music teacher what Cary finds out she spent the night in the country with, after her car, you know, broke down, or so she says. Then, she finds out Cary didn't go on no trip. So they divorce. She starts trying' ta get her mind offa him by getting friendly with some big lug of a hick but then realizes she still loves Cary Grant.<br /><br />I wouldn't wanna give nothing away 'cause then that'll spoil it for ya and I'm no jerk. But I tell ya, I was rolling on the floor over here, busting' up with laughter and such. Ain't nobody gonna blame Cary Grant for being' in love with Irene Dunne. I mean, she ain't just beautiful. She's a funny broad. And ain't no person gonna blame Irene Dunne for wanting Cary back. I mean, I'm no fruit or nothing, but if I was, in a hypothetical, completely hypothetical-type situation, I would certainly be giving Irene a run for her money, not that I would though 'cause I ain't no fruit. And their dog is a hoot! I wish I could get my mangy mutt to do some o' the stuff the dog in this picture does.<br /><br />This is one o' my favorite movie pictures. If you ain't seen it, you betta get to it if ya know what's good for you. And if you don't like it, I'll bust ya freaking head open. Cary Grant and Irene Dunne are freaking beautiful together. It's like a match made in Heaven, for Chrissakes.", "include": 1}
{"text": "I saw this at the Waterfront Film Festival in Saugatuck, Michigan and it was one of my favorite short films of the festival.<br /><br />This short was great. So funny and original. It's a modern day retelling of how the Tinman lost all of his limbs, his lover, and his heart. It was wonderfully made, the acting, the cinematography, it was a really cool movie. I particularly loved the music that played throughout the film, it really added the entertainment.<br /><br />You should really check this film out. It was an award winner at the 2007 Sundance Film Festival. I'll be looking out for more of director Ray Tintori's films.", "include": 1}
{"text": "Has anyone noticed the similarity of Grady to Shangri-La?<br /><br />The airplane crash brings Conway to the lamasary of Shangri-La; a car smash brings Ben Stone to Grady.<br /><br />Both find a world in which they can function apart from their 'chosen' capitalistic professions.<br /><br />Unlike 'Witness', 'Doc Hollywood' does what we all would: find that entrance to Shangi-La and never look back! Who, even a Yankee, could leave Grady? Who, even an Englishman could leave Shangri-La?<br /><br />A great movie!<br /><br /> -30-", "include": 1}
{"text": "This little known 1955 melodramatic gem starring Joan Crawford, Barry Sullivan, Betsy Palmer, John Ireland, Lucy Marlow is not only incredibly over-dramatic (sometimes hilariously so) but a great opportunity for Joan Crawford to show off her inner diva and those great acting skills of hers.<br /><br />Emotions run high as ruthless Southern socialite Eva Phillips (the Queen Bee - played by else but the magnificent Joan Crawford who is absolutely in her element) manipulates those around her, turning them against each other. The story begins when her sappy cousin (badly played by Lucy Marlow - you are almost happy when she gets slapped) arrives at Eva's mansion and boy, is she in for one wild ride! Affairs, suicide, car accidents, love, manipulation all drive this movie.<br /><br />It is such a pleasure to watch Eva Phillips tear people apart and see the cunning ways in which she works and gets her own way. The script is, as I previously said, insanely dramatic (and sometimes the lines aren't delivered well - bad acting) and sometimes it got very funny as it just seemed really pathetic. That doesn't mean I didn't enjoy it though - no, I loved every minute of it. I loved Eva Phillip's ability to torment the people around her (for example - calling her drunk, scarred husband 'Beauty') - it was incredibly fascinating to me. And the ending was very rewarding too.<br /><br />Undoubtly over-the-top to the point of laughing, but a very entertaining ride perfect for a day in. I enjoyed every minute of it, I thoroughly recommend it to comedy and drama fans alike - both could get some enjoyment out of this.", "include": 1}
{"text": "While it may not be as classic as other sci-fi from the 1950's, this fanciful bit of sci-fi schlock does just fine for a nights' viewing.<br /><br />A group of archaeologists find themselves descending deep into the earth where they discover not only a lost civilization of light-sensitive albinos, but the title creatures, used and abused by their human counterparts.<br /><br />John Agar, Hugh Beaumont, Alan Napier, Cynthia Patrick, and Nestor Paiva star, and the performances, like the film itself, are fun. The sets are decent, the pacing pretty efficient, and the music enjoyable. The photography is often dark and moody, adding a fair amount of atmosphere. There are even some nicely tense moments. Sure, it may be a little silly, and one may have to be partial to this kind of film to begin with, but I found it to be very engaging stuff.<br /><br />It begins with a surprisingly lengthy lecture by an apparent scientific expert on the earths' core, which is an interesting way to start. The ending is also not quite what one would expect.<br /><br />All in all, I found this little picture very amusing and very watchable.<br /><br />7/10", "include": 1}
{"text": "Rather than despairing about the loss of a comedic genius or the choices made by studios or Director Blake Edwards after his death, my review will focus on Trail of the Pink Panther's successful eulogy for the series and the great Peter Sellers. The film is clearly a tribute from its dedication - \"To Peter, the one and only Inspector Clouseau\" to its ambiguous and seemingly symbolic ending.<br /><br />The Pink Panther has been stolen, and Clouseau (Sellers) is on his way to Lugash. Over the ocean, his plane disappears. Is Clouseau really gone or is this just another of his ingenious tricks and is he undercover in Lugash hunting the perpetrator. Chief Inspector Dreyfus (Lom)is at first overjoyed - he may finally be rid of Clouseau - but soon enough he begins to suspect that he will see his former colleague again, and his debilitating obsessions return. Meanwhile, a French reporter (Lumley) begins a series of investigative reports trying to get to the bottom of the Clouseau disappearance. She interviews Cato (Burt Kwouk) and many of Clouseau's enemies, colleagues and acquaintances.<br /><br />Sellers appears in the film only in archive footage and scenes cut from previous films. The same is true for most of the other Panther veterans in the film, but several new Dreyfus scenes were added. The first half of the film, prior to Clouseau's disappearance, hang together well-enough - but it is very clear that we are seeing a film which has been loosely cobbled together from a collage of material. The second half, while more coherent and linearly plotted, lacks Peter Sellers - and - really - just isn't very funny.<br /><br />Lom, Kwouk and Lumley turn in the best performances here, and after Clouseau's disappearance, Lom and Kwouk are really the only performers who occasionally create a laugh.<br /><br />The absence of Peter Sellers is palpable in the second half of the film, and although the film clearly attempts to remain light-hearted and Pantheresque, this absence lends a sadness to Trail of the Pink Panther which makes it a much more successful eulogy than comedy. However, all considered, it is probably the least entertaining film in the Pink Panther canon.", "include": 1}
{"text": "A story about a girl in a psychatrie hospital who just wants to be free. She lives in her own dreamworld with dolphins. There is a young boy who falls in love with her. He wants to help her to come free...<br /><br />There is no dialogue, but that doesn´t matter.You don´t need dialogue to feel the love between the people. This is the way cinema has to be: pure magic! If you don´t cry when you watch this movie, you must have a heart of stone. Open your mind and feel...", "include": 1}
{"text": "I walked into the cinema not knowing what to expect. There had been no publicity whatsoever about this film and I was surprised. Very tense, very dramatic and well acted. An Interesting take on plot thats been done so many times before, but never quite like this. While its obvious what happens in the end you really want to see it through to the end, so it must have done something right.<br /><br />It's also nice to see that here in Britain we can produce something other than Romantic Comedies and cheap gangster films. Here we have something of a certain class that's quite a good yarn while being far deeper than most US films. I hope it's a sign of things to come.", "include": 1}
{"text": "This movie did more to explain, use, and get characters out of, time travel paradoxes then anything I have ever seen on the screen. This movie BLEW ME AWAY with how it handled what had seemed like a goofy premise when the flick had come out. I have now watched it from beginning to end on three occasions, and it continues to blow me away. The casting of the father and son in 1969 and the present day are great, and watching the son unfold with every change in the past is wonderful. Why this movie didn't even get nominated for a Hugo Award (the awards given by the World SF convention each year) amazes me- it should have won the award.", "include": 1}
{"text": "**May be a spoiler or two but probably not** <br /><br />\"Street Fighter: The Legend of Chun-Li\" is about a Chinese/American girl who goes from being a gifted concert pianist to Wushu master and savior of Bangkok Thailand's slums. And that is pretty much all that is discernible from a plot that bounces around more than the heroine when she battles bad guys...and girls. The movie's downfall is its attempt to cram too much of everything into a world and story that is a lot more simple.<br /><br />The film starts off earnestly enough. The sweet tunes of a grand piano gently transport us into an ordinary world that is soon going to come crashing down. And crashing down it does and not in the good 'bashing your opponents face into the pavement' way, but rather in the bland character's, bad acting, convoluted and totally unbelievable story kind of way. Now, before I get into how bad this movie really is I will start with what is good about it. But 'good' certainly does not mean redeemable. The cinematography and camera work are great and truly capture the essence of the places the story takes us. The fight scenes are well-choreographed and well-shot for the most part, which is more than most Hollywood martial arts heavy films can say these days(I am glaring at the insanely hard to follow 'static-cam' of the \"Bourne\" films and Bond's latest foray into an unwelcoming action-genre).<br /><br />And that, viewers, is where the goodness of this hack ends. What follows is a lot of over-acting to the point of hilarity, cheap and pointless one-liners, too many implausible scenarios that don't have any basis in anything related to reality. And yes, I know, this is 'Street Fighter' and it is based on a mildly supernatural video game but some of the events that occur in this film are just too over-the-top(Bison 'delivering' baby scene...enough said). The film raises questions we as viewers shouldn't need to ask...and then we never get answers to those questions! Chun-Li and Gen are the films 'strong' points. Bison is nowhere near as imposing as he should be. And even though his Irish(yes, apparently Bison is Irish) parents died just after he was born and he was raised on the streets of Bangkok with nothing but Thai people, adult Bison somehow managed to retain a spot-on Irish accent. Balrog is just plain hokey. Vega (who is supposed to be a Spaniard, but certainly is not in the film) is...well he just is. His character is neither cool nor threatening and not even as arrogant as he is supposed to be. The characters of Nash and Det. Sunee are totally forgettable and as a matter-of-fact totally unbelievable as well. No decent high-ranking detective, like Sunee claims to be, walks around as scantily clad as she does when she's at work.<br /><br />Oh my God, ladies and gentlemen, I could go on and pick this film apart piece by piece but that would entail me giving away spoilers...and this film has spoiled having only been released yesterday. You wouldn't waste your money on spoiled food would you? I think not, so don't waste it on this tripe.<br /><br />And for the record I am a fan of the games and I have seen the animes and read the graphic novels. I think I speak for all real fans that we want Ryu and we want Ken. We want their journey from children to brothers to karate street fighting masters. We want their revenge on Akuma and Ryu's scarring bout with Sagat. Simple. Right? No Interpol, no sexy cops, and no Shadaloo (supposed to be Shadow Law btw). You don't need those things to have a great fan pleasing 'Stree Fighter' film do you? I didn't think so. Simple. Simple. Simple. God, I am writer...I should just write the damn thing. It would certainly be better than what has been so far.<br /><br />Done.", "include": 1}
{"text": "The sad thing about For The Bible Tells Me So is that the people who need to see this most are the ones who will be forbidden by their church to watch this very timely documentary. But for those who do get to see it they will be inspired and uplifted.<br /><br />As a gay 60 year old man who has lived in the last half of the last century I saw many marvelous changes at how Gay/Lesbian/Bisexual/Transgendered people have been viewed in American society and in the world at large. Growing up as I did in the fifties and sixties it would never occur to me to do something as courageous as young Jacob Reinert, not only coming out in Mankato, Minnesota, but bringing his parents into the fight for equality. <br /><br />For too many still gay is something where emotion kicks in and reason just flies out the door. Why is it so, religion and those few bible verses put down for an ancient tribe to make sure they multiplied and dominate, have become the touchstones to justify all kinds of hatred and bigotry.<br /><br />A distinguished group of religious scholars talk about how this came to be in western monotheist religions. There not names you know associated with Christianity or Judaism because there not on the air and in your pocket to stay on the air. They present quite a contrast with the bible thumpers where we see video going back as far as Billy Sunday. <br /><br />The man who comes in for the most scorn is James Dobson, pop psychologist and big kingpin on the religious right. Young Jacob Reinert attempts to confront him, but the most moving story in the film concerned Mary Ann Wallner who listened to Dobson's advice about rejecting her lesbian daughter who later kills herself. <br /><br />For The Bible Tells Me So makes it abundantly clear the political nature of the anti-gay religious right. GLBT people are the 'other' the straw villains you create to justify why the populace should empower your crowd. As Hitler did to the Jews, so the religious right has done to us.<br /><br />My favorite moment in the film was when one of the scholars challenges these religious leaders to obey Jesus's commandment to sell all you have and give it to the poor and then you can follow him. Talk about selective Bible reading, can you see a Pat Robertson doing that? It can never be forgotten that these folks place different emphasis on certain bible verses as opposed to others.<br /><br />My working life consisted in large degree of working at NYS Crime Victims Board as an openly gay investigator. I saw the most manifest examples of anti-gay hate, culminating in violence with serious injury and death. The religious right who keep talking about how our sin is so horrible are the ones who give justification to those who would do us bodily harm. I wish they could see their handiwork from where I sat for 23 years.<br /><br />For The Bible Tells Me So, is an excellent documentary that will hopefully win an Oscar in that category next year. And this review is dedicated to the young people from Soul Force I met and broke bread with in my city this past spring. As long as there are people like these confronting the hate and getting the message out, I have no worries about a movement or its ultimate success.", "include": 1}
{"text": "Kirsten Dunst is a beautiful, talented actress. But even SHE could not save this dumb, plodding movie. Once again, Canadians prove conclusively that they can<br /><br />NOT make good films. But Kirsten? My GOD, she looks sexy, even when she is<br /><br />sweeping a porch!!! But, if you want to see her really do her thing, watch the movie Spiderman. The kissing scene in that movie is incredibly erotic.<br /><br />Hey, I really like romantic movies. See \"Ten Things I Hate About You\" or \"French Kiss\" for romance. This movie? \"Deeply\" should have been buried, deeply, very deeply. It is pure dreck, except, of course, for the total Dunst fan, who will enjoy watching her beautiful features and amazing grace.", "include": 1}
{"text": "I'll admit I love the look of Foghorn Leghorn but I hate his cartoons. Come on, they are ALL the same. It'll start out a normal day on the farm then that annoying bird will come along and say 'I'm a chicken hawk' a hundred times. Foghorn will pretend to not be a chicken but get clobbered anyway. The impartial barnyard dog will get involved and they'll repeat the same unfunny joke over and over until the 7 minutes are up. Am I right or am I right?<br /><br />This was the routine EVERY Foghorn Leghorn cartoon followed and I have never liked, even when I was a little kid. This cartoon is notable for being the first appearance of the Rooster but for no other reason.", "include": 1}
{"text": "I agree with other viewers that the Louise character is neurotic at best. However, one must consider the era in which the film is set. World War II has ended, and older single women like Louise would like to find Mr. Right and settle down. Enter David, portrayed by Van Heflin, whose ambition is hidden by an exterior that alternates between (1) warm and romantic and (2) cool and aloof. He obviously has strung Louise along for some purpose, and he dumps her when she presses him for a commitment. Like most women of the era, Louise probably has been reared to be emotionally and financially dependent on men, whom she and her contemporaries see as \"strong, secure, brilliant and perfect.\" Whenever a relationship in that era did not work out, society would blame the woman for the failure, never recognizing that men can have flaws, bad motives, and other shortcomings. Hence, there is the neurotic or psychotic condition to which Louise succumbs.<br /><br />It seems obvious to me that David already had staked out a certain business owned by Dean Graham, portrayed by Raymond Massey, and that David was using Louise (Mrs. Graham's nurse) to worm his way into the business and lives of the Graham family and cash in on the goods. Dean, being a kind and well-meaning individual, was blind to David's true ambition to marry Dean's naive and gullible daughter Carol and eventually get control of the business and family fortune. (Of course, once the mission was accomplished, David would use and abandon Carol just as he had used and abandoned Louise). David even brags about his objective to marry Carol and spend the family fortune just before Louise shoots and kills him. However, Louise has her own motives, having internalized the reason for David's abandoning her, and she cannot see the whole picture of David's plot. Inadvertently Louise delivers poetic justice by ending David's ambition and saving the Graham family and fortune.", "include": 1}
{"text": "Sarah Johnson had a lot of talent before her mother died but gained a lot more talent having to live in the Chicago ghetto (A lot of talented people come from the ghetto). Sarah gained the talent to dance hip-hop, even to use it in one of her audition dances for Julliard. Sarah was caught in a dilemma of choosing ballet or hip-hop and she finally felt in her heart that performing hip-hop was better than trying to be a famous ballerina. She had a new lover, new friends and a new life. There is no interracial problem but she does have a new black boyfriend (last one dropped he for his scholarship. The basic story is did she make a mistake going for Julliard.", "include": 1}
